{
  "projects": [
    {
      "url": "http://www.digitaldividedata.com",
      "text": "doctype html Digital Divide Data (DDD) - Changing How the World Works Solutions Content and Data AWS Cloud Machine Learning Social Research Clients Clients Case Studies Impact Our Model Success Stories Impact Sourcing Impact Partners About Mission and History Leadership Corporate Information Industry Recognition Careers News Take Action Solutions Content and Data AWS Cloud Machine Learning Social Research Clients Clients Case Studies Impact Our Model Success Stories Impact Sourcing Impact Partners About Mission and History Leadership Corporate Information Industry Recognition Careers News Take Action Our mission is to TRANSFORM LIVES Discover DDD Pioneering next generation WORKFORCE DEVELOPMENT Watch Video Our solutions make LASTING IMPACTS Learn More Preserving the past with LEADING EDGE TECHNOLOGY Watch Video Offering clients a MOTIVATED WORKFORCE Learn More Creating paths to PROMISING FUTURES Learn More Using impact sourcing to BREAK DOWN BARRIERS Learn More Propelling hundreds of families OUT OF POVERTY Learn More DDD delivers digital content, data, and research services to clients worldwide Today, we successfully deliver work to hundreds of international clients from four operation centers around the globe. From a small data entry operation in Cambodia founded in 2001, the company now offers a wide range of digital content and technology services. DDD is the largest technology-related employer in Cambodia and Laos and recently won Kenya's Vision 2030 Award for the Best BPO. DDD's unique Impact Sourcing model has developed a growing network of young professionals and propelled hundreds of families out of poverty. SOLUTIONS DDD's solutions support your business and fill skill gaps with reliable BPO solutions that make a lasting impact. Learn More DDD IMPACT DDD has helped thousands of talented, motivated individuals create a path to a more promising future. Learn More OUR MODEL We create more than just jobs. DDD creates sustainable opportunities for underserved individuals and their communities. Learn More ABOUT DDD DDD transforms lives through sustainable training and employment programs which provide a path to lifelong opportunity. Learn More OUR CLIENTS DDD offers an engaged, motivated workforce that allows your business to be more efficient and globally competitive. For nearly two decades, DDD has provided content, data, and technology services to world’s leading organizations and enterprises, including universities and research institutions, cultural heritage organizations, nonprofits and NGOs, and commercial enterprises. Learn More DDD believes talent has no boundaries—and opportunities shouldn’t either. Learn more how our solutions can support your business and transform lives around the world. Contact DDD Today Contact DDD Today Name * Name First Name Last Name Company * Email * Phone Phone (###) ### #### Contact Reason * Request a Quote Donate Other Message * Thank you! Back to Top CONNECT with DDD: Home | Solutions | Clients | Impact | About | News | Take Action DDD: Changing How the World Works. Copyright 2018 DDD   |   All Rights Reserved",
      "themes": [{ "id": "ecdev", "name": "Economic Development" }]
    },
    {
      "url": "http://www.gpsvs.org",
      "text": "html Home The mission of the Organization is to develop people's conscience to coexist with nature; function with high moral values; develop tolerance towards all faith; propagate compassion and non-exploitative attitude in interactions; achieve dignity , self -reliance , equity and sovereignty .​​ BRIEF JOURNEY OF  GPSVS ABOUT US ​ GPSVS is a civil society organization based in Madhubani district of Bihar. GPSVS was established on 18th April, 1977 as a consequence of a sustained voluntary involvement of its founder members in their collective struggle for access to land (agriculture and homestead) for landless, decentralising democracy and community based mechanisms for self reliance and sustainability, fight against unrestricted distortions within society, cultivating a block (an administrative unit in a district) as the focal point for promoting an inclusive model of Swarajya, Vikas, and Sangh (Self Reliance, Development and Organization). The concept and practices of total revolution is the culture of the organization and it derives its inspiration to work towards its vision by adhering to the value systems and beliefs of Mahatma Gandhi , Vinoba Bhave and Jayprakash Narayan . Home What We Do Resources Media Contact Us ​ Give your helping hand to those who need it! Donate Now! Join Our Campaign! ​​​​​​​ GPSVS has a vision of re-establishing Gram Swarajya ( Village self - reliance) based on principles of Equity , Justice , Tolerance and Ahimsa ( Non Violence ) and channelizing efforts towards a society in which moral revolution constitutes an integral parts of its functioning GPSVS is registered Under Societies Registration Act-1860 (XXI) , FCRA-1976 & Income Tax exemption Under Sec. 12 A and 80 G View on Mobile",
      "themes": [
        { "id": "ecdev", "name": "Economic Development" },
        { "id": "health", "name": "Health" }
      ]
    },
    {
      "url": "http://www.ruchika.org",
      "text": "html Ruchika Social Services Organization – A Voice for All Children Menu Ruchika Social Services Organization A Voice for All Children Search for: Facebook Primary Menu Skip to content Home About Us About the Founder The Managing Committee Annual Reports The Global Fund for Children FAQ Why Help? Watch the PBS Documentary How to Help Programs Education Programs Platform Schools Alternative Education & Remedial Support Inclusive Education Programs Mobile Toy Library Balwadi Creches Girls’ Sponsorships Asra 24 Hours Boys’ Shelter CHILDLINE (1098) HIV / AIDS Awareness Program PACT & SHAKTI Project for Child Protection SMART Centre Vocational Training Water & Sanitation Program Swachh Samudai Videos News & Views Join us on Facebook Contact Us Search Search for: Platform Schools Posted on December 15, 2016 By pesi In the year 1985, an innovative educational initiative was started at the Bhubaneswar Railway Station for the children wandering, begging, rag picking in and around the railway station, which later become famous as “The Platform School”. The objective was to reach out to these underprivileged children and impart joyful education and give awareness on health Read More ... Alternative Education & Remedial Support Posted on December 15, 2016 By pesi Bhubaneswar, the capital of the state of Odisha, attracts a large number of impoverished, homeless, and unemployed families who migrate from rural areas. 40% of its population resides in 436 slums. With the Right to Education Act 2009 in force, children living in slums still do not have adequate access to government schools. The key Read More ... HIV / AIDS Awareness Program Posted on December 15, 2016 By pesi To reduce the vulnerability of the street adolescent children of Bhubaneswar to STI and HIV/ AIDS by providing appropriate education and service, Ruchika started the “Operation Healthy Platform” project. Its main objectives were to sensitize the community (street adolescents, their parents, youth, women and community leaders) on the sexual health issues and health rights to Read More ... CHILDLINE (1098) Posted on December 15, 2016 By pesi CHILDLINE (1098) for Children in Distress In 1996, Childline India Foundation (CIF) launched this project “CHILDLINE”, the country’s first toll-free telephonic helpline for children in distress and/or difficult situations. As of now, it operates in 366 cities in all over India through its network of over 700 partner organizations. We are also a partner and Read More ... Home The railway platforms of Bhubhaneshwar in India have long been a breeding ground of despair, where underprivileged children of all ages have been subject to frequent abuse, starvation and neglect – preyed upon for the purposes of child labour and even prostitution. Since 1985, Ruchika Social Service Organization with just a handful of dedicated volunteers and an underpaid staff, has committed itself to extricating street children from their apparently hopeless lives by providing safety, nutrition and education, to give them an opportunity to grow into a world of endless potential and realize the dream of every human being – to lead a safe and fulfilling life. RSSO maintains that the way to lead children out of this predicament is to ensure that their time is constructively utilized in learning and to equip them for a productive future, by reinforcing their self esteem in ways that bring some joy and love into their young lives. Through its innovative and varied programs, Ruchika is a Charitable Organization that seeks to: Provide all children with a joyful and creative school atmosphere that incorporates education and skills relevant to a meaningful and dignified existence. Equip children with the knowledge necessary to become active participants and positive contributors to their communities Create a society free of child labour, abuse, destitution, exploitation and abandonment. When will children begin to matter? RSSO has dedicated itself to the ideal that… If a child cannot come to school, then the school must come to the child How would you feel if this were your child? EVERY CHILD HAS THE RIGHT TO EDUCATION, HEALTH & SECURITY WANTED Applications are invited from candidates for the post of “Caregiver cum Bridge Course Educator” in Open Shelter at Ruchika Social Service Organization, Bhubaneswar. The candidate must be a graduate, between 21-35 years of age. The post is residential. Please apply on or before 12-02-2019, 3:00 pm with complete Bio-data, Xerox copies of all certificates and a passport size photograph by Registered/ Speed Post to the address given below: The Collector, Office of the District Child Protection Unit, In front of Old Collectoriate, Khordha. Platform Schools In the year 1985, an innovative educational initiative was started at the Bhubaneswar Railway Station for the children wandering, begging, rag picking in and around the railway station, which later become famous as “The Platform School”. The objective was to reach out to these underprivileged children and impart joyful education and give awareness on health Read More ... Videos The railway platforms of Bhubhaneshwar in India have long been a breeding ground of despair, where underprivileged children of all ages have been subject to frequent abuse, starvation and neglect – preyed upon for the purposes of child labour and even prostitution.   Click on any title on the right to watch the video About the Founder Inderjit Khurana In response to the growing and seemingly insurmountable challenges faced by children in the slums of Bhubaneswar, Inderjit Khurana, an experienced teacher and director of her own successful school, founded the Ruchika Social Service Organization in 1985. Initially it comprised of a single “Platform School” and is presently reaching out to over 4,000 Read More ... Facebook Facebook Copyright © 2019 Ruchika Social Services Organization . All Rights Reserved.  | Catch Responsive by Catch Themes Scroll Up Home About Us About the Founder The Managing Committee Annual Reports The Global Fund for Children FAQ Why Help? Watch the PBS Documentary How to Help Programs Education Programs Platform Schools Alternative Education & Remedial Support Inclusive Education Programs Mobile Toy Library Balwadi Creches Girls’ Sponsorships Asra 24 Hours Boys’ Shelter CHILDLINE (1098) HIV / AIDS Awareness Program PACT & SHAKTI Project for Child Protection SMART Centre Vocational Training Water & Sanitation Program Swachh Samudai Videos News & Views Join us on Facebook Contact Us",
      "themes": [
        { "id": "children", "name": "Children" },
        { "id": "edu", "name": "Education" },
        { "id": "gender", "name": "Women and Girls" },
        { "id": "health", "name": "Health" }
      ]
    },
    {
      "url": "http://www.bnwla.org",
      "text": "html Revisionee\n - YouTube Skip navigation Sign in Search Revisionee Videos Playlists Community Channels About Home Trending History Get YouTube Premium Get YouTube TV Best of YouTube Music Sports Gaming Movies TV Shows News Live Spotlight 360° Video Browse channels Sign in now to see your channels and recommendations! Sign in Watch Queue Queue Watch Queue Queue Remove all Disconnect The next video is starting stop Loading... Watch Queue Queue __count__/__total__ Revisionee Subscribe Subscribed Unsubscribe 1,775 Loading... Loading... Working... Home Videos Playlists Community Channels About Grid List Date added (newest) Most popular Date added (oldest) Uploads 5:37 Play next Play now ✅ TOP 10: Things To Do In Munich - Duration: 5 minutes, 37 seconds. 8 views 13 hours ago CC 5:37 Play next Play now ✅ TOP 10: Things To Do In Hamburg - Duration: 5 minutes, 37 seconds. 453 views 1 day ago CC 5:02 Play next Play now ✅ TOP 10: Things To Do In Budapest - Duration: 5 minutes, 2 seconds. 634 views 3 days ago CC 5:31 Play next Play now ✅ TOP 10: Things To Do In Athens - Duration: 5 minutes, 31 seconds. 968 views 4 days ago CC 6:04 Play next Play now ✅ TOP 10: Things To Do In Seattle - Duration: 6 minutes, 4 seconds. 1,875 views 1 week ago CC 5:18 Play next Play now ✅ TOP 10: Things To Do In Nice - Duration: 5 minutes, 18 seconds. 1,973 views 1 week ago CC 5:48 Play next Play now ✅ TOP 10: Things To Do In Berlin - Duration: 5 minutes, 48 seconds. 2,127 views 1 week ago CC 6:33 Play next Play now ✅ TOP 10: Things To Do In Paris - Duration: 6 minutes, 33 seconds. 2,243 views 1 week ago CC 5:55 Play next Play now ✅ TOP 10: Things To Do In Lille - Duration: 5 minutes, 55 seconds. 2,063 views 1 week ago CC 5:46 Play next Play now ✅ TOP 10: Things To Do In Lyon - Duration: 5 minutes, 46 seconds. 2,117 views 1 week ago CC 5:48 Play next Play now ✅ TOP 10: Things To Do In Avignon - Duration: 5 minutes, 48 seconds. 2,063 views 2 weeks ago CC 6:03 Play next Play now ✅ TOP 10: Things To Do In Tallinn - Duration: 6 minutes, 3 seconds. 2,118 views 2 weeks ago CC 6:00 Play next Play now ✅ TOP 10: Things To Do In Marseille - Duration: 6 minutes. 2,143 views 2 weeks ago CC 5:40 Play next Play now ✅ TOP 10: Things To Do In Helsinki - Duration: 5 minutes, 40 seconds. 2,146 views 2 weeks ago CC 6:27 Play next Play now ✅ TOP 10: Things To Do In Vancouver - Duration: 6 minutes, 27 seconds. 2,209 views 3 weeks ago CC 6:03 Play next Play now ✅ TOP 10: Things To Do In Toronto - Duration: 6 minutes, 3 seconds. 2,296 views 3 weeks ago CC 5:18 Play next Play now ✅ TOP 10: Things To Do In Prague - Duration: 5 minutes, 18 seconds. 2,253 views 3 weeks ago CC 6:10 Play next Play now ✅ TOP 10: Things To Do In Montreal - Duration: 6 minutes, 10 seconds. 2,172 views 3 weeks ago CC 5:44 Play next Play now ✅ TOP 10: Things To Do In Hong Kong - Duration: 5 minutes, 44 seconds. 2,127 views 3 weeks ago CC 6:23 Play next Play now ✅ TOP 10: Things To Do In Copenhagen - Duration: 6 minutes, 23 seconds. 2,328 views 4 weeks ago CC 5:40 Play next Play now ✅ TOP 10: Things To Do In Banff - Duration: 5 minutes, 40 seconds. 2,146 views 1 month ago CC 5:26 Play next Play now ✅ TOP 10: Things To Do In Calgary - Duration: 5 minutes, 26 seconds. 2,272 views 1 month ago CC 6:24 Play next Play now ✅ TOP 10: Things To Do In New York - Duration: 6 minutes, 24 seconds. 2,222 views 1 month ago CC 6:00 Play next Play now ✅ TOP 10: Things To Do In Ostend - Duration: 6 minutes. 2,196 views 1 month ago CC 7:12 Play next Play now ✅ TOP 10: Things To Do In New Orleans - Duration: 7 minutes, 12 seconds. 2,262 views 1 month ago CC 5:58 Play next Play now ✅ TOP 10: Things To Do In San Francisco - Duration: 5 minutes, 58 seconds. 2,121 views 1 month ago CC 6:24 Play next Play now ✅ TOP 10: Things To Do In Houston - Duration: 6 minutes, 24 seconds. 2,510 views 1 month ago CC 5:48 Play next Play now ✅ TOP 10: Things To Do In Los Angeles - Duration: 5 minutes, 48 seconds. 2,135 views 1 month ago CC 6:39 Play next Play now ✅ TOP 10: Things To Do In Miami - Duration: 6 minutes, 39 seconds. 2,745 views 1 month ago CC Loading... Load more Language: English Location: United States Restricted Mode: Off History Help Loading... Loading... Loading... About Press Copyright Creators Advertise Developers Terms Privacy Policy & Safety Send feedback Test new features Loading... Working... Sign in to add this to Watch Later Add to Loading playlists...",
      "themes": [{ "id": "rights", "name": "Human Rights" }]
    }
  ]
}
