{
    "projects": [{
        "url": "https://catbeachpenang.com/",
        "text": "html HOME - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact HOME Selamat Datang ke Pantai Kucing! Welcome to Cat Beach Penang! CAT BEACH SANCTUARY CAT BEACH IS A NO KILL SHELTER, LITERALLY THE LAST RESORT FOR HOMELESS CATS RESCUED FROM DESPERATE SITUATIONS ADOPT  VOLUNTEER  DONATE! DIRECTIONS TO CAT BEACH PENANG BEST TIMES TO VISIT? Saturdays & Sundays  11 am to 4 pm Other times by appointment  +6 017 575 3419 Please help Cat Beach help cats DONATE NOW ONLINE For bank transfer information, please see our Donations Page Donations can be made online with Credit or Debit Card or PayPal at www.paypal.me/TeviotCatBeachPenang WHATS COMING UP? 13 January  BOOK LAUNCH BENEFIT FOR CAT BEAC H Heartfelt thanks to Prof. Wong Teik Aun whose new book will support Cat Beach. Bring a friend for coffee and meet the author at the Frank Laurent Coffee Roasters in Georgetown, Penang from 2 to 5 pm 26 & 27 January  HUNGRY CATS OPEN HOUSE & YARD SALE  Last Weekends of each Month 10 February  BE MY VALENTINE! ARE YOU A CAT LOVER? Your donation of RM 100 per person entitles you to Membership (Joining Fee & Annual Dues) for the 2019 Year  should you decide to accept it  in the Cat Lovers International Society, Penang. catbeachsanctuary@gmail.com or Whatsapp/SMS/Call +6 017 575 3419 READ THE LATEST NEWSLETTER Enjoy the serene and beautiful views of the sea, fishing fleet, mountains and surrounding jungle and meet the wonderful Cats! LINKS Facebook  Cat Beach Penang Instagram  Cat Beach Sanctuary Twitter  Cat Beach Cats The Ragna Fund for Vet Care for Cats Donate thru GoFundMe Crowdfunding CLICK HERE TO JOIN OUR MAILING LIST (The Cafe is currently closed due to storm damage but we can always offer you a cuppa from our neighborhood cafes) Beachside Cat Cafe Hot or cold Coffees & Teas, sweet snacks & more Enjoy the serene and beautiful views of the sea, fishing fleet, mountains and surrounding jungle 2nd CHANCES CHARITY STORE & Bi-monthly Jumble Yard Sales Great pre-loved and new things  cheap! Toys, Clothes, Appliances, moreIn-kind donations to the store as well as for the cats are always welcome! TRAVELERS BOOKSHOP Come browse our amazing selection of hard and softbound books, most preloved, low prices  RM 5  RM 100. All proceeds from sales and activities go to the care of the Cat Beach cats. Seacats Art Gallery Cats, of course! But our growing collections include art inspired by the sea, Nature, and Penangs amazing multicultural mixSupport artists and cats with your purchases of artwork. And make your mark by creating cat art at Cat Beach!Artists always welcome! ENJOY A DAY AT THE BEACH  WITH CATS! Stop in to have a look-around or a tour, enjoy the beautiful view, browse the 2nd Chances Charity Store for goodies, get creative & make or bring home some Art for Cats Sake and meet the friendly cats! Ask how you can VOLUNTEER for even an hour  we can always put people to work on grooming and cat care. You will be glad you helped and get more kitty cuddles than you ever dreamed of! DISCLAIMER Please note that that you visit Cat Beach at your own risk.By entering the property, you agree that you will not hold Cat Beach Sanctuary, Cat Lovers International Society, or any persons of the staff or volunteers, owners, tenants or any other associated persons responsible in case of accident, injury, theft or any other issues whatsoever. YOUR SUPPORT MAKES ALL THE DIFFERENCE FOR THESE RESCUED CATS! Allincome received from sales and donations goes to support the Cat Beach cats.  DONATIONS GRATEFULLYACCEPTED PAYPAL ME DONATION Cat Beach Penang via Teviot GoFundMe international donation crowdfunding site Malaysia Bank  CIMB Bank Savings Account # 7063481337 (Mohd Iqbal bin Zainal) Please notify us by email, messaging, or whatsapp of your donation so we can thank you! PLEASE JOIN OUR MAILING LIST  Cat Beach is located at the midpoint of the seashore in the fishing village of Teluk Bahang,Penang Island, Malaysia. Find us on Google Maps!Cat Beach on Google ADDRESS: 778 Jalan Teluk Awak, MK2, Teluk Bahang, Penang TO REACH CAT BEACH PENANG Come thru the tourist town of Batu Ferringhi. 10 minutes later, you will reach the Teluk Bahang Roundabout. Turn RIGHT (3 oclock) at the Roundabout and head towards the sea. The End of the World restaurant will be on your left. Go 2 blocks to the Police Station (if you are on foot, you can go straight and walk along the beach).  Turn LEFT and continue another 2 blocks to our driveway. You will pass Fishing Village Seafood (top rated!) and then TB Seaside Cafe.The first driveway after TB Cafe on your right leads to Cat Beach. The Cat Beach driveway is located between a white concrete building and a red metal warehouse. Across the street, there is an Ice Factory and there are usually lorries (trucks) parked around the driveway entrance. There is also a garbage collection dump directly across on your left, driveway is on the right. If you get to Ah Tong Cafe or the pedestrian bridge, you have just passed the entrance  go back! Come into the parking lot and say hello to the many cats that will greet you! (Please watch carefully so cats are not hit by vehicles). Park if you are in a car or on motorcycle. Look for the big tree to your right. Walk towards the beach, entering through the gazebo and gate.The brown wooden bungalow by the sea is the main house of the cat sanctuary. Come in and say hello! For further information, please telephone the Cat Beach Landline at +6 04 88 11 015 or Teviot at +6 017 575 3419. Or write catlovers.my@gmail.com or catbeachsanctuary@gmail.com . Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html Page not found - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Oops! That page cant be found. It looks like nothing was found at this location. Maybe try one of the links below or a search? Search for: Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Most Used Categories News (31) Uncategorized (27) *Highlight (12) Archives Try looking in the monthly archives.  Archives Select Month October 2018 September 2018 July 2018 May 2018 March 2018 February 2018 January 2018 November 2017 October 2017 August 2017 May 2017 March 2017 February 2017 December 2016 November 2016 October 2016 September 2016 July 2016 June 2016 February 2016 November 2015 September 2015 May 2015 Tags Advocate art at cat beach benefit cat Cat Beach Cat Beach Sanctuary Cat Cafe cat care Cat Lovers International Society cat nurse Cats cat sanctuary cats penang charity sale Christmas donate education event Harian Metro helpcats internship jobs Jumble Sale kittens kittensintrouble Malaysia minizoo nurse Paradise for Cats Penang Penang island Penangpac rabies Sanctuary stamps Teluk Bahang theatre TICKETS tourism vet care veterinary vet tech volunteer Welcome to Cat Beach worldwide veterinary services Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html 2018 Operating Budget - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact 2018 Operating Budget 2017 EXPENSES  CAT BEACH SANCTUARY* * Please note: Charts and Calculations shown on this page are not yet confirmed by professional accountants or auditors and therefore subject to correction or change. With a basis from our 2017 Expenses for Cat Beach Sanctuary (chart above), the 2018 Operating Budget necessarily reflects the greater number of cats and kittens under care. As of July 2018, Cat Beach now cares for approximately 300 cats. Hardly a day goes by without another request for Cat Beach to take in a cat in need of rescue from a dangerous or emergency situation. To meet the increased demand, Cat Beach has had to invest in people to care for the cats  renting accommodations where cat lover friends / volunteers can stay and increasing stipends for meals and other incidentals. Significantly, the amount of cat food consumed daily has increased steadily as have the electric, water and other utilities costs. Weather, insects, and wear-and-tear continually deteriorate the property so repairs and renovations are crucial. Meantime, veterinary expenses and medications continue to be major costs with added expenses for transport to and from the veterinary clinics. The future for Cat Beach and the rescued Cats depends on increasing income from all sources, especially donations. Current efforts are focused on engaging with cat lovers who can donate monthly funds or food in support. Tourism and educational programs can provide new income. Sales of items and services also offer additional income streams. Social enterprises and partnerships with companies like Gold-D / AHA and Miya Co House of All Things Cat can bring in new resources for long-term sustainability. 2018 JANUARY to JUNE EXPENSES DAILY CONSUMABLE EXPENSES include: 10  12 kg Adult Cat Dry Kibble 3.5 kg    Kitten Dry Kibble 48+ pouches  Junior Wet Food 12  15 tins  Adult Wet Food 2  3     Whole Chickens (boiled) 3 kg      Rice Multivitamins, fish oils and other immune support supplements Cleaning Supplies including Bleach, Detergents for dishwashing and laundry, Garbage Bags, and assorted equipment  brooms, mops, pails, sponges, etc. 2015 to 2018 EXPENSES* (subject to change) Current estimates for 2018 are that expenses total about RM 30,000 per month ($7,250 USD. 6,230 Euro). Please donate generously to help Cat Beach help rescued cats. DONATE Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html Cat Beach Penang - cat sanctuary and rescue - Teluk Bahang Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact CONTACT Contact Us Address: Cat Beach Sanctuary 778 Jalan Teluk Awak, MK 2 Teluk Bahang 11050, Penang, Malaysia Phones: Mobile:+6 017 575 3419 Landline: +6 04 8811 015 Malaysia Country Code: 6 Email: catlovers.my@gmail.com OR catbeachsanctuary@gmail.com Facebook: Cat Lovers International Society, Penang https://www.facebook.com/CatLovers.my Cat Beach Penang https://www.facebook.com/catbeachpenang/ Donations may be made via https://paypal.me/TeviotCatBeachPenang or on the crowdfunding site http://www.gofundme.com/catloversintl Call me! Or just sms! Or Whatsapp! Or @catbeachpenang on Facebook Messenger! Or Catbeachsanctuary on Instagram. Or CatBeach on Twitter! So many ways to be in touch! Name: Please enter at least 2 characters Email: Please enter a valid email Subject: Please enter at least 2 characters Enter number 365: Please enter the correct number Message: Please enter at least 10 characters I consent to having this website collect my personal data via this form. Submit Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html VISIT - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact VISIT WELCOME TO CAT BEACH! Cat Beach Cats Love Visitors and Volunteers! When you come out to Cat Beach, there are so many things that you & your family and friends can do! Heres just a short list of the many possible activities. Groups are very welcome. See below for more Activities at Cat Beach. Visitors are encouraged to come on Weekends 11 am to 4 pm. Other times are possible as well by reservation (cat care is a 24/7 job!). RESERVATIONS: If you or your Group plan to visit Cat Beach, please be in touch so we can try to arrangefor someone to be on hand to greet you. Email: catbeachsanctuary@gmail.com or sms/whatsapp to +6 017 575 3419. ACTIVITIES AT CAT BEACH A Day at the Cat Beach can be lots of fun!Come hang out with Cats! Pet a Cat! Or many! Play with a Cat! Clean a Cat! (our Team will teach you how) Learn more about Cats! Paint a Cat  Make Art Projects Make a Cat Toy  Crafts Projects Peruse the Travelers Bookstore Browse the 2nd Chances Charity Store Take home Art from the Seacats Art Collection Or just Chill Out with the Cats  ask for a cold or hot drink and enjoy the sea view! More Ideas: Host an Event  Barbecue Beach Party, Seaside Tea Get Eco-friendly with a Beach Cleanup  garbage bags, gloves, tools provided Pitch In as a Volunteer  Clean cages, dishes, floors, etc! Join the Team Projects: ADMINISTRATION BUILDINGS & GROUNDS CAT CARE OUTREACH & EDUCATION EVENTS  Yard Sales, Classes, etc. CAT CARE TRAINING In just a few minutes, you too can get started to become a trained Cat Carer! Learn grooming, cat handling, de-parasite treatments, and more. Feel free to ask all the questions you have ever had about cats and our knowledgeable volunteers will try to answer. VISIT THE KITTEN NURSERY Want to learn more about kittens? A trained Volunteer will ask you to wash up, then will take you upstairs to visit the Kitten Nursery. Ssh! Kittens need to sleep a lot! Kittens need lots of cleaning, deflea combing and health checks. You can also get trained in bottle feeding (which can take awhile!) Learn more about Kitten Care and Fostering! If you or your group plans a visit to Cat Beach, please let us know so we can be sure to have someone on hand to greet you. Email: catbeachsanctuary@gmail.com or sms/whatsapp to +6 017 575 3419. Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html HOME - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact HOME Selamat Datang ke Pantai Kucing! Welcome to Cat Beach Penang! CAT BEACH SANCTUARY CAT BEACH IS A NO KILL SHELTER, LITERALLY THE LAST RESORT FOR HOMELESS CATS RESCUED FROM DESPERATE SITUATIONS ADOPT  VOLUNTEER  DONATE! DIRECTIONS TO CAT BEACH PENANG BEST TIMES TO VISIT? Saturdays & Sundays  11 am to 4 pm Other times by appointment  +6 017 575 3419 Please help Cat Beach help cats DONATE NOW ONLINE For bank transfer information, please see our Donations Page Donations can be made online with Credit or Debit Card or PayPal at www.paypal.me/TeviotCatBeachPenang WHATS COMING UP? 13 January  BOOK LAUNCH BENEFIT FOR CAT BEAC H Heartfelt thanks to Prof. Wong Teik Aun whose new book will support Cat Beach. Bring a friend for coffee and meet the author at the Frank Laurent Coffee Roasters in Georgetown, Penang from 2 to 5 pm 26 & 27 January  HUNGRY CATS OPEN HOUSE & YARD SALE  Last Weekends of each Month 10 February  BE MY VALENTINE! ARE YOU A CAT LOVER? Your donation of RM 100 per person entitles you to Membership (Joining Fee & Annual Dues) for the 2019 Year  should you decide to accept it  in the Cat Lovers International Society, Penang. catbeachsanctuary@gmail.com or Whatsapp/SMS/Call +6 017 575 3419 READ THE LATEST NEWSLETTER Enjoy the serene and beautiful views of the sea, fishing fleet, mountains and surrounding jungle and meet the wonderful Cats! LINKS Facebook  Cat Beach Penang Instagram  Cat Beach Sanctuary Twitter  Cat Beach Cats The Ragna Fund for Vet Care for Cats Donate thru GoFundMe Crowdfunding CLICK HERE TO JOIN OUR MAILING LIST (The Cafe is currently closed due to storm damage but we can always offer you a cuppa from our neighborhood cafes) Beachside Cat Cafe Hot or cold Coffees & Teas, sweet snacks & more Enjoy the serene and beautiful views of the sea, fishing fleet, mountains and surrounding jungle 2nd CHANCES CHARITY STORE & Bi-monthly Jumble Yard Sales Great pre-loved and new things  cheap! Toys, Clothes, Appliances, moreIn-kind donations to the store as well as for the cats are always welcome! TRAVELERS BOOKSHOP Come browse our amazing selection of hard and softbound books, most preloved, low prices  RM 5  RM 100. All proceeds from sales and activities go to the care of the Cat Beach cats. Seacats Art Gallery Cats, of course! But our growing collections include art inspired by the sea, Nature, and Penangs amazing multicultural mixSupport artists and cats with your purchases of artwork. And make your mark by creating cat art at Cat Beach!Artists always welcome! ENJOY A DAY AT THE BEACH  WITH CATS! Stop in to have a look-around or a tour, enjoy the beautiful view, browse the 2nd Chances Charity Store for goodies, get creative & make or bring home some Art for Cats Sake and meet the friendly cats! Ask how you can VOLUNTEER for even an hour  we can always put people to work on grooming and cat care. You will be glad you helped and get more kitty cuddles than you ever dreamed of! DISCLAIMER Please note that that you visit Cat Beach at your own risk.By entering the property, you agree that you will not hold Cat Beach Sanctuary, Cat Lovers International Society, or any persons of the staff or volunteers, owners, tenants or any other associated persons responsible in case of accident, injury, theft or any other issues whatsoever. YOUR SUPPORT MAKES ALL THE DIFFERENCE FOR THESE RESCUED CATS! Allincome received from sales and donations goes to support the Cat Beach cats.  DONATIONS GRATEFULLYACCEPTED PAYPAL ME DONATION Cat Beach Penang via Teviot GoFundMe international donation crowdfunding site Malaysia Bank  CIMB Bank Savings Account # 7063481337 (Mohd Iqbal bin Zainal) Please notify us by email, messaging, or whatsapp of your donation so we can thank you! PLEASE JOIN OUR MAILING LIST  Cat Beach is located at the midpoint of the seashore in the fishing village of Teluk Bahang,Penang Island, Malaysia. Find us on Google Maps!Cat Beach on Google ADDRESS: 778 Jalan Teluk Awak, MK2, Teluk Bahang, Penang TO REACH CAT BEACH PENANG Come thru the tourist town of Batu Ferringhi. 10 minutes later, you will reach the Teluk Bahang Roundabout. Turn RIGHT (3 oclock) at the Roundabout and head towards the sea. The End of the World restaurant will be on your left. Go 2 blocks to the Police Station (if you are on foot, you can go straight and walk along the beach).  Turn LEFT and continue another 2 blocks to our driveway. You will pass Fishing Village Seafood (top rated!) and then TB Seaside Cafe.The first driveway after TB Cafe on your right leads to Cat Beach. The Cat Beach driveway is located between a white concrete building and a red metal warehouse. Across the street, there is an Ice Factory and there are usually lorries (trucks) parked around the driveway entrance. There is also a garbage collection dump directly across on your left, driveway is on the right. If you get to Ah Tong Cafe or the pedestrian bridge, you have just passed the entrance  go back! Come into the parking lot and say hello to the many cats that will greet you! (Please watch carefully so cats are not hit by vehicles). Park if you are in a car or on motorcycle. Look for the big tree to your right. Walk towards the beach, entering through the gazebo and gate.The brown wooden bungalow by the sea is the main house of the cat sanctuary. Come in and say hello! For further information, please telephone the Cat Beach Landline at +6 04 88 11 015 or Teviot at +6 017 575 3419. Or write catlovers.my@gmail.com or catbeachsanctuary@gmail.com . Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html Advice/Info about Volunteering at Cat Beach - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Advice/Info about Volunteering at Cat Beach ADVICE/INFO ABOUT VOLUNTEERING AT CAT BEACH SANCTUARY We often get inquiries from volunteers about what they need to bring or prepare before coming to stay and what they can do to help the cats at Cat Beach, so heres our suggestions. You wont need much as life is pretty relaxed and tropically warm hereand almost anything you need is available locally and is cheaper here than elsewhere. Of course, you are welcome to bring anything that a cat can eat or play with always appreciated by the cats! LOCATION Cat Beach Sanctuary is located in a small fishing village known as Teluk Bahang, in the northwest corner of Penang island (also known as Pulau Pinang  Pulau meaning island and Pinang as the Malay language spelling of Penang). We are 10 minutes walk from the Penang National Park where there is good hiking thru the jungle. It is about 10 minutes by bus to the bustling tourist beach resort town of Batu Ferringhi; it is about 1 hour to George Town by bus but there are good shopping malls including an immense Tesco within 30 minutes bus ride. Teluk Bahang has all the basics available in little grocery stores and street hawker stalls  and usually much cheaper than elsewhere. Plus the food is great  morning markets every day and a Monday night market which is an experience in itself. Cat Beach details  You can have letters or packages sent here from elsewhere but please know mail can travel very slowly (3 weeks from USA). Address:Your Name Cat Beach Sanctuary, In care of c/o Mr Nana 715 Jalan Teluk Bahang, MK 2Teluk Bahang, Pulau Pinang 11050Malaysia Phone numbers  landline 6 04 88 11 015 / Teviots mobile 5 017 585 3419 / 6 0112 644 7856 A DAY AT THE BEACH Volunteers also want to know what kind of work they will be doing and how they can be of help to the cats, so heres a description of what we do daily at Cat Beach (with of course breaks for swims, coffee / tea, chats, and kitty hugs and playtimes). There is actually an endless amount of work to do to help the cats  plus throughout the yearwe host holiday season festivities and (fingers crossed) the beachside Cat Cafe, 2nd Chances Charity Store, and the Seacats Art Gallery and educational projects help to bring visitors and support to the Sanctuary. Your help on the many cat care tasks, and/or renovations, gardening, administration, photo & video documentation, etc. can really make a difference. Many hands make light work! ACCOMMODATIONS Again, there is the proviso that we are not able to offer really comfortable, cat-free accommodations at this time. Hoping to rent a house nearby but nothing confirmed yet. We do have some beds in the house and outbuildings  but always with kitty companions expected. Some stay in tents (we have one) or even in the large covered enclosures (with animals). Recently, we had 3 women who decided to stay at the dorm at Alis Guesthouse which is a 5-minute walk from Cat Beach. They each paid rm 20 per nite (discount). There are a number of inexpensive choices nearby in town or in nearby Batu Ferringhi. So a homestay or guesthouse nearby is an alternative to the mattresses, couches and hammocks here. DAILY WORK As to work expectations  we ask for about 4  5 hours daily commitment and are very grateful for any more that people can devote. We do understand that part of the enjoyment of the stay is to get to see more of fascinating Penang! People come and go  and of course, if you need time off, you are a volunteer so you just say so  but then just try to give some more time another day, that would be kind. Best case for us is when volunteers commit to certain hours and let us know when they will go out and come back. Schedules are flexible  we normally work in 3 to 4 hour shifts  morning, afternoon, evenings, late nights. Most people recently seem to be giving about 5  6 hours per day  including time to play with the cats and help with grooming and petting them (socialization is so important!) The work is divided between the Daily Routine and Projects. The daily stuff just has to be done every day to keep the place decent and the cats cared for as best we can; the projects are varied and go on as we have people, time, and money to do them.. DAILY ROUTINE Normally our regular team starts feeding the Cats Breakfast at 8 am, followed by a lot of cleanup  washing dishes, cleaning up overnite messes, wiping down surfaces, sweep, mop, do laundry, etc. Then we move on to replenishing water and food, cleaning cages, bottlefeeding kittens, cleaning kittens and cats and giving medications, etc. Helping to get the cages and the caged cats clean and comfortable in the morning is top priority. By 10:30 am or so, most of that work is usually complete as long as there are enough people pitching in. There is a Morning Market up the street open from 7 am to 11 am, so often about 10:30, volunteers head over to the market to get breakfast or to pick up fresh fruit, veggies, etc. Really cheap and really fresh  fruit comes from the Tropical Fruit Farm on the hillside above the town  doesnt get any fresher than that! After shopping and breakfasting, we do double checks of cages and feeding stations, cats health, and any more cleanup needed. The rest of the day is flexible schedule-wise. Some people stay and start project work  could be bathing cats, deflea / deworming, cleaning out refrigerators, creating cat art or painting walls or signs, doing repairs, prepping beds for volunteers, putting up decorations, cleaning the grounds, gardening, doing computer work or admin paperwork, etc, etc. Some people have made photo documentation of the cats or photo essays, others have made really useful promotional videos to post on YouTube and Facebook. Some people work on the accounts or donor database, others work on projects for outreach to the schools or community to get cats adopted or donors to help fund. One wonderful German guy installed 50 meters of electrical cable and switchboxes and lights  made a huge difference. Another American / Polish builder pulled down two old roofs and rebuilt a floor. Recently, a Finn couple built a cage divider and added shelves for cats to rest on; they also installed a new light in the bathroom. So  the projects really are down to the skills and interests of the volunteers and the current needs of the cats and the buildings. Between 4 and 5 pm, we do Cats Dinner. The routine is pretty much the same as the morning, although it usually goes a bit faster. If we have enough volunteers, we split up the day so some do morning feeding, others do afternoon. Projects can continue at night. Sometimes we have meals together if someone feels like cooking (pasta is my specialty); most of the time people go out to explore (world famous, top 10 best places to eat) Penang food from local vendors, or take the bus to the beach resort of Batu Ferringhi with countless restaurants, or head into George Town  the city  for the evening. Late in the evening  usually 10 pm on  we start the evening feeding and do medications for any sick cats that have to have meds 2 times each day. Kitten care is a priority. Then closing up normally takes about an hour  rice and extra food out to get cats thru the night, fresh water and fresh dry kibble for overnite, washing last dishes, wiping down everything, last minute sweep / mop, checks of cages and sick ones, putting kittens to bed with extra bottlefeeding and feeding the foster moms, dropping tarps for rain protection, overnite laundry load, lights turned off, doors closed, etc. It can be a real help to have 1 or 2 people to help on the late night closing, especially if we have a lot of deflea / deworm or meds to do. Thats pretty much it for the work  which can seem endless! CAT CARE (AND COMPASSION FATIGUE) To give the best possible care to the animals (and yes, sometimes we have visiting puppies too) really can be a challenge. It is often an emotional experience  we laugh and play and fall in love with cats and then they may get sick or injured, and especially the youngest motherless ones, may even die. Injured and sick ones periodically just appear from nowhere (or are dumped here) and we do our best to make them comfortable but that may not be enough. Please do prepare yourself a bit. It can be heartbreaking sometimes. But also heartfulfilling! Please understand that this whole project is premised on the idea that it is better for the strays and homeless to be rescued and brought in from the streets to a place where they receive regular healthy food, dry warm shelter, and the comfort of loving care. Note that Penang state has declared a Zero Strays Policy meaning that at any time strays can be picked up off the street by the authorities. Unfortunately, this often means they will be destroyed. Cat Beach gives a no kill sanctuary to cats that come from truly desperate situations. Given that we are based in an old wood house and aging concrete buildings on the beach, please understand that it can never be perfectly sanitary despite our daily efforts. What it can be is a place of sanctuary for cats coming from desperate situations that have nowhere else to go. As one volunteer said, If we dont help them, no one will Almost all the cats have been rescued by kind-hearted people from drains, garbage dumps, behind restaurants and shops. They cannot care for them in their homes but they dont want them to be pts e.g. killed. We are a no kill shelter and only allow a veterinarian to decide if an animal is suffering and no hope. In all cases, we do our best within limited resources to give the cats a happy life. If you believe  as some do  that strays would be better off left to die on the streets, then please, this is not for you. Lastly, please do think carefully before allowing negative thoughts and comments color your experience. We understand it is not for everyone  some volunteers stay for months or even years; a few have come and feel overwhelmed and leave within hours. Travelers often experience culture shocks, travel exhaustion, and a sense of dislocation. Volunteers for many causes can reach a burnout state; animal care in particular can be highly stressful. We all experience compassion fatigue at times  so please do give yourself good self-care, rest or take a break when fatigue hits, and then come back refreshed and calm to help the cats! Please help to spread the good word and positive energy as it will help to improve our care for the cats. Negativity just undermines the courage and abilities of the committed volunteers to help these rescued cats the very best we can. Your attitude of positive caring really affects the cats as well  they are very intuitive. Please help to maintain an atmosphere of calm, affection,trust and safety  and have fun with the cats! CAT BEACH PRIORITIES The comfort of the cats is #1! This includes good regular nutrition as top priority with fresh clean water and dry kibble 24/7 plus 2 wet meals per day, as clean an environment as we can make it but especially for caged animals (cages are only used for new animals to allow adjustment time or for sick or injured, then set free when ready), veterinary care as needed for illness and injuries, vaccination, sterilization (yes, we do desex as many as we can, depends on the availability of vets and donors to support), adoption or fostering or providing a home at Cat Beach for the lifetime of the cat. VOLUNTEERS CHECKLIST What should you bring for yourself? Clothing You will want to have lightweight clothes that you dont mind getting dirty  we do have a washing machine and there is a laundry shop nearby so not to worry. Around Cat Beach, super casual dressing is ok but please be respectful of Malay / Malaysian society when you go out and cover up a bit, especially women.Youll also want a sweater or jacket for the bus or other transport as they crank up the aircon. You may want flipflop sandals. We ask that you change shoes to flipflops when you come in the house (we have some but you might want your own) so as not to track in outside dirt. Please do wear the flipflops indoors and in the toilet, dont go barefoot as you might pick up a fungus (like athletes foot in a gym). If you swim, bring along a swimsuit and other swim gear. Protection  Sun protection  sunscreen, dark glasses, hats, etc Mosquito and insect protection  (we usually do have some in stock) Rain protection (umbrella, poncho  again we have some you can borrow) Essentials Passport (from most countries, you get 90 days free entry on arrival  check the embassy websites) Money (things are cheaper here in the fishing village than elsewhere on the island so you dont need a lot of cash in hand  maybe RM 100 to start, but no banks in this town so you have to go to the tourist town of Batu Ferringhi  abt 15 minutes on the bus  to get cash) Meds  Meds and Cosmetics  any special meds, cosmetics, creams, shampoos, etc that you use Suggested: antihistamines  allergy pills can be useful  some people have been surprised at finding themselves allergic to mosquito or spider bites, or even cats. Useful to calm down your body reaction to bites and stings (yes occasionally there are jellyfish in the sea) Food Any special kinds of food you have to have- * Please do let us know ahead if you are vegan, vegetarian or have allergies or other special issues with food. You will be expected to look out for your own needs and preferences, please. Electronics  Electronics of various kinds  we do have wifi in house  so smartphones, laptops, etc can get online ok most of the time Cameras (cats, the sea, and the landscape all pretty photogenic and photos and videos can be of real help to promote the cats). Electrical adapters for your electronics and appliances Phone with a local SIM can be very useful, especially with GPS. Bedding  Other optional items: tent if you want to camp, sleeping bag (lightweight it is usually hot here! we have lots of bedding so not to worry), hammocks, etc- Shots Get Your Shots. Not much to worry about in Malaysia. What we do suggest is to get a tetanus injection as theres a lot of rusty stuff around. You might want to check out the current US Center for Disease Control recommendations see http://wwwnc.cdc.gov/travel/. Re: Rabies Shots. Unless you plan to go to a really remote place, it is not worth it to get a rabies shot in my opinion at least not for here in Penang. We had a horrific rabies scare last fall and within 2 weeks  after culling (killing) some 3000 dogs  Penang has been declared rabies-free. Apparently, there were actually NO cases of rabies here. See http://www.missionrabies.com/ for full information on rabies control. You can take their free online course (as I did) to become a Certified Rabies Educator. Cats are definitely NOT a rabies threat. Dogs may be, especially in rural places in Asia and Africa. Almost all rabies transmission to humans is via dog bites. And if you ever do get bitten by a dog, go straight to a hospital or clinic even if it is minor. You have several days before you must start anti-rabies injections. Rabies travels thru the nervous system, not the blood. Yes, in an average of 21 days, it can travel up to the brain and then it is fatal. But caught early, it is 100% curable. The recommendation for pre-bite rabies shots is that professionals working with rabid animals should probably get the preventative course. However, it is not fully effective in all cases and if bitten, the regular series of after-bite injections needs to be given anyway. Medical Services Nearby There is a government clinic walking distance from Cat Beach with very low cost services (free to Malaysian citizens). In George Town, there are a number of excellent world class hospitals  Penang is a medical tourism center. Theres even a vegetarian hospital, Penang Adventist, that vegans and vegetarians travel from around the world to visit and we recommend as offering the best services to Westerners. You would receive excellent and cheap health care here if ever needed. Theres more to read about health and vaccinations on the WHO, CDC, and other sites like WebMD, but heres some of what I found for Malaysia: QUOTE:Make sure you are up-to-date on routine vaccines before every trip. These vaccines include measles-mumps-rubella (MMR) vaccine, diphtheria-tetanus-pertussis vaccine, varicella (chickenpox) vaccine, polio vaccine, and your yearly flu shot. Get travel vaccines and medicines because there is a risk of these diseases in the country you are visiting. Hepatitis A  CDC recommends this vaccine because you can get hepatitis A through contaminated food or water in Malaysia, regardless of where you are eating or staying. Typhoid = You can get typhoid through contaminated food or water in Malaysia. CDC recommends this vaccine for most travelers, especially if you are staying with friends or relatives, visiting smaller cities or rural areas, or if you are an adventurous eater. END QUOTE Also recommended elsewhere are Hepatitis B, Japanese encephalitis and malaria possibly> Please check with your doctor about recommended vaccines and meds for your travels. Health Hazards Dengue fever is the one thing that people get in Penang carried by Aedes mosquitos. The authorities fog this small town about once a month and i do not know anyone who has contracted it in this area, although the symptoms can be so mild that people may not notice they have had it unless they get it a second or third time  supposedly worse in many cases, the more times you get it and there have been fatalities. So if you get a fever of any kind, it is worth heading to a doctor. Tropical diseases differ from those in temperate climates and can be much more serious. We have recently had a rabies scare  and it resulted in what was one of the most upsetting things I have ever experienced in working with animals  the culling of more than 3000 dogs in this state. It has now officially stopped and Penang has been declared rabies-free but dogs and reportedly cats too are still being captured and killed if someone complains. But theres no worry about rabies One last thought  You will need to increase your intake of salt and sugar. We drink a lot of isotonic electrolyte drinks. Because the air and your bodys temperature are nearly the same. often you may not realize you are sweating out your salts. And even locals end up in the hospital with dehydration. If you get even a little dizzy, dont just drink water, drink an isotonic drink or take in some sugar and salt plus water. Please feel free to ask any questions you may have and we will try to answer! Happy Travels! Thanks for your interest in volunteering to help the Cat Beach Cats! Teviot & Cats Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html Why Cat Beach? - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Why Cat Beach? Why do we need Cat Beach? In the rural Malay fishing village of Teluk Bahang in Penangs northwest corner, local fishermen have been caring for cats for the past decade. Meanwhile in the sophisticated city of George Town, just an hour away, homeless cats are found by kind people every day in the ditches and drains, at markets and restaurants or they may simply have been dumped on the street. Where can they go? Now there is Cat Beach. Why now? A Zero Strays Policy went into effect in July 2014 for Penang state. This means rescued cats cannot be returned to their home colonies and other shelters have no space to keep cats long-term. While we support the principle of removing cats and other animals from the streets, we do not condone their killing. This has given special urgency to the need for a no kill cat sanctuary  a place for cats rescued from desperate situations to live and receive regular and loving care. Thats why a small group of cat-loving volunteers decided in the summer of 2014 to set up a sanctuary for cats. We are inspired by the work of Barbara Janssen who shelters more than 600 dogs at the 4PAWS shelter just up the street. . Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html The CAT-a-log - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact The CAT-a-log THE CAT-a-log Welcome to a Gallery of wonderful Cat Beach Cats! With about 250 cats at any given time, we are sure we can match you up with a cat! Adopt a Cat today!And if you cant take one home right now, just think  you could sponsor a cat virtually online! Some of our Special Needs cats really would appreciate that! ( Click here to email us for more info ).To prepare for adoption, please read about what you need to think about and our Adoption procedures. Download our free booklet, YOUR NEW CAT! Meet GRUMPY ! A long-time non-adoptable Cat Beach Cat, Grumpy appears every few days to loudly demand a special plate of Junior food. The distinctive red nose had us worried that she was ill with sporo fungal infection but we had her tested and luckily, shes ok. Unlike most of the cats at Cat Beach, she is not an adoptable cat  too grumpy  but she is a real character that delights and amuses Cat Beach visitors. Grumpy needs Cat Beach  theres just nowhere else for her to go. Just watch out for her claws  and never try to take her food away! AUBRAEN Mid last yr, Aubraen was found barely breathing by the roadside by a nice lady & her son. She took Aubraen to vet  severe URI and then brought her to CB. Aubraen first started off as a little feral but is now a huge cuddlebug and loves giving hugs. She also has a slight heart murmur but that hasnt stopped her from playing for hours. Aubraen is a very vocal cat when she wants something. In March 2018, she was caged for a severe infection that caused abcesses under the skin and wounds  not likely a fungus as shes responding well to antibacterial treatment.Fave things are napping in the parking lot pagoda, gorging herself on tuna, going for walks while cuddled in someones arms and yelling at people for head scratchies. Tata, our clown! Tab Hunter Young Sugar Kitty Ralph BonBon Bonnie Princess Putri and her beautiful babes Rosy Little Bear  a short-tailed Siamese.. Beautiful Amber Halia Sleeping Gimly I dare you to tickle me! Spice Girl Bianco Cream Midnight Im sittin in yer basket Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html Daily Life at the Beach - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Daily Life at the Beach Some shots from the daily life of Cat Beach cats (and people) Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html Jobs - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Jobs Help Cats! Jobs and Internships at Cat Beach Cat Beach Sanctuary offers a number of job opportunities. Here at Cat Beach, were keen to support you in your career development and dedicated to having a positive impact on the community. Youll have a variety of opportunities to contribute your skills and knowledge, and to practice and learn while making a difference for cats who truly deserve our help. To apply, write to catbeachsanctuary@gmail.com . Please send information about yourself and why you are interested in working at Cat Beach. Cat Beach is growing step-by-stepand new cats arrive almost every day! Were looking for enthusiastic, self-motivated, hard-working individuals to join our great team and help us give excellent care to the cats. If you have a background in cat or human healthcare or administration, and can join our team long-term, we may be able to offer job benefits which can include pay, housing, meals, etc. But if you have less experience and a positive, determined attitude, you are very welcome to apply for a job or shorter term stay at Cat Beach. Some benefits including housing may be available by arrangement. Volunteers are always welcome! Internships in Shelter Administration, Cat Care, and other programs can be arranged with your sponsoring university or other organization. JOBS AT CAT BEACH SANCTUARY GENERAL TASKS  CAT CARER Work hands on with Cat Beach cats to keep them clean, safe and comfortable. Grooming, deflea, deworm and other tasks assigned each day and can include cleaning cages, workrooms and the Sanctuary. Help socializing with the healthy adoptable cats, and assist as needed with the care of the sick and injured. Welcome and document new cats coming in, as well help introduce visitors and volunteers to the cats in tours. Help keep the Sanctuary running smoothly by pitching in on the many daily and project tasks. SANCTUARY SUPERVISOR  TEAM MEMBER  VOLUNTEER COORDINATOR Can you commit long-term (2 months or mo) to helping at Cat Beach? Join our Supervisors Team to plan, assign tasks, monitor, and keep records. Pitch in where needed to ensure that the Sanctuary is clean, safe and comfortable for both the cats and for the humans who visit. An important part of the job is to welcome, train, and support volunteers and visitors. CAT CARE: CAT NURSE OR NURSING ASSISTANT This involves focused work on distributing the daily medications and carrying out the instructions of veterinarians. Monitoring the cats health, records keeping, and ensuring that all sick and injured cats receive special care will be the main tasks. CAT CARE: KITTEN CARER Kittens and the Momcats can have many serious health issues and need special care. You will receive specialized training to give correct bottlefeeding, medications, cleaning and more. You will need to be very conscious of germ transmission (fomites) to keep the Kitten Nursery as safe and clean as possible. ADMINISTRATION: DATA ENTRY Good with a computer? Weve got sit-down tasks with data entry, social media posting, sorting and organizing files, and much more. At present, we must enter and maintain several growing databases including: Supplies Inventory; Financials: General Ledger of Income/Expenses; Contacts  Visitors, Donors, Members; and the Cat-alog of Cats including a huge collection of Photographs and Videos, as well as records of Vet Visits and Daily Medications for I/O. ADMINISTRATION: PROMOTION & SOCIAL MEDIA OUTREACH Many opportunities exist for outreach worldwide through the internet. Currently Cat Beach has several Facebook Pages, Instagram, and a website. You can help to expand readership and the support base through posts, research, and communications. Locally, almost every day in Penang, there is some kind of event  a festival, conference, meeting, street fair, etc. where Cat Beach could be represented with a table, flyers, and a warm smile. You can help build local engagement by researching, scheduling, and organizing attendance at events. ACTIVITIES MANAGERS / ENTREPRENEURS: Management, Advertising & Sales Projects including The Beachside Cat Cafe, 2nd Chances Charity Store and online Sales, Travelers Bookshop, the Seacats Art Gallery and other income-producing projects. Have you ever dreamed of running a small business? Cat Beach Sanctuary will provide financing and support for entrepreneurs willing to join our team, build the customer base, and manage one or several of our income-producing projects. Click here to see more detail about currently available jobs. Apply by sending your background and interest to catbeachsanctuary@gmail.com Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html Volunteer Cat Care Positions Available - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Volunteer Cat Care Positions Available Current Vacancies: Shelter Supervisor Vet Nurse / Vet Tech Secretary / Administrator Social Media Outreach Coordinator If you are interested in working to help cats, please send an email indicating your backgroundand availability to catlovers.my@gmail.com . All work at Cat Beach is volunteer with some allowances paid for a long-term commitment. Housing and other benefits may be available. Hours are flexible and negotiable for part and full-time work.Start immediately, part or full-time. Shelter Supervisor Position Description : (volunteer or paid allowance) Seeking responsible and reliable person(s) to serve as Shelter Supervisor  mainly to ensurethat the daily work of the shelter is carried out. Qualifications: good common sense, reliable, speak English and Malay, can do updates via internet, reasonably diplomatic for team work. Your work would be mainly supervisory  to doublecheck the conditions, supplies and medications and do whatever necessary to ensure the cats are well-cared for. This includes extensive cleaning and cat care by volunteer staff, medications and extra care for sick or injured cats and extra care for kittens. You would be the go to person to make sure there are sufficient supplies in place. The supervisor deals with new cat arrivals, greets visitors, and issues, problems, emergencies. An important task is to update and request info from Director via internet. Depending on your experience and skills, the tasks here can be adjusted. Your main task is to see that the cats are ok  there is a teamthat will do most of the cleaning and other volunteers put to work on grooming kittens and cats, etc. We would prefer that the Supervisor stay overnight on the property or make sure someone is there to deal with night-time emergencies. The volunteers now can stay in an upstairs bedroom with huge picture windows overlooking the sea  with kitty companions, of course. You would doublecheck every few hours throughout the day and night that all cages and feeding stations are cleaned and sterilized daily, check on Water-Food-Poop Trays-Bedding, and that there are cleaning and food supplies in place. You may need to go out or order more.In case of emergency, you may also need to coordinate getting cats to the vet. You would either do the medicating tasks yourself or ensure that the vets instructions are carried out for the sick and injured. You may have to break up some cat fights in the middle of the night (we have gentle routines for this), meet and greet cat rescuers bringing more cats, and help as you can to keep the place, the cats and the people as clean and calm as possible. You may also have to deal with 3rd World situations like utilities going off, sea storms with high winds, lost or sick cats, etc. So your main qualifications would be good common sense in decision-making  and the ability to communicate via the internet or phones. More tasks if able and willing. Could lead to long-term work if desired. Veterinary Nurse / Vet Tech Job Description The Veterinary Nurse or Technician helps assess the need for veterinary care and carries out the supervising veterinarians instructions for medications and care of sick or injured cats. Other important aspects of the job include detailed records-keeping, health assessments, scheduling of vaccinations, sterilization, and medical treatments, and intake documentation and care of new cats and kittens. Research, makingrecommendations and assisting to improvesanitation, supplies, special care procedures, etc., and reporting to the Director and board will also be very helpful as the Sanctuary continues quality improvement. Administrator / Secretary / Receptionist Job Description A variety of administrative tasks need to be done to help Cat Beach reach professional levels of service to the cats and the public. Responsibilities include arranging rescued cats delivery and giving directions and information to visitors by phone and email. The administrator will have a variety of tasks to handle: data entry of contacts and cats records, record the intake of new cats, meet-and-greet and log visitors, accept and receipt donations and expenses, do bookkeeping and invoicing, and assist with other admin tasks including publicity and promotions. With the aid of virtual volunteers, updating and maintaining several databases will be important including the Cat-a-log of the Cat Beach cats, Members, Donors, Media and Other Contacts, Suppliers, etc. Social Media Outreach Coordinator Creating and carrying out social media campaigns as well as regular and effective communications with a growing list of supporters are crucial to the sustainability of the Sanctuary. Campaigns are in planning stages for Adoption, Fostering, Donations  In-Kind, Donations  Financial, and Volunteering. Promotion of other programs (Cat Cafe, 2nd Chances Charity Store, Seacats Art Gallery, Educational Projects, etc.). Working closely with the director and advisors, the Social Media person will develop campaigns, create posts, and work to increase support for the Sanctuary and its cats. Good writing, editing and computer skills, English language ability (and possibly other languages), and reliability are the primary requirements. Ability with photography and/or videography can be very helpful. Some or most of the tasks can be done on home computers but regular visits and communications with the Sanctuary in Tk Bahang or the Office in Batu Ferringhi will be needed to be most effective. For further information, please schedule a visit to Cat Beach Sanctuary. Contact us at catlovers.my@gmail.com to arrange an interview and trial. Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html CATS INTAKE - Surrender Form - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact CATS INTAKE  Surrender Form Persatuan Pencinta Kucing Antarabangsa CAT LOVERS INTERNATIONAL SOCIETY, PENANG A registered non-profit charitable animal welfare organization Malaysia ROS # PPM 003-07-21012105 CAT BEACH SANCTUARY 778 Jalan Teluk Awak, MK 2 Landline: +6 04 8811 015 Teluk Bahang 11050 Penang, Malaysia H/P: +6 017 575 3419 Email: catlovers.my@gmail.com or catbeachsanctuary@gmail.com Website: www.catbeachpenang.com SURRENDER AGREEMENT DATE: YOUR NAME CIRCLE ONE: Owner / Rescuer (temporary owner) / Representative / Other: Your Address Phone Whatsapp Email Facebook / Other / Website Your IC or Passport Number  CAT(S) NAME(S) How many cats? Description (color, age, hair SML, tail SML, any distinguishing marks?) Age(s) Male / Female? Location where found or living: Circumstances and Reasons why this cat (these cats) needs sanctuary: (use back if needed) Vet Visit? Y/N Name of Vet or Clinic: Vaccinated? Sterilized? Any known history? Neighborhood, accidents, injuries, previous owners, etc.?  This agreement signifies that the Owner or the Rescuer  temporary Owner  or a Representative for the person listed above and hereinafter referred to as the Former Owner, hereby surrenders ownership of the Cat (or Cats) described here to Cat Beach Sanctuary and its umbrella organization, the not-for-profit Cat Lovers International Society Penang, hereinafter referred to as the Sanctuary. As a last resort sanctuary for cats rescued from desperate situations, the Sanctuary Team agrees to do the best they can to provide basic levels for shelter, food and water, and care for cats surrendered and entrusted until such time as the Cat is adopted or for as long as the cat remains within the Sanctuary property. The Former Owner understands that the Cat may be adopted or fostered out. If a suitable adopter is found, the Owner agrees that he/she will make no demands of the Sanctuary or of the new Owner for the cats return. If the former Owner should wish to reclaim the cat or finds a potential adopter, he/he agrees that Cat Beach Team should be the final decision maker for adoption and that the new Owner must go through the regular Adoption and vetting process. Due to the open situation and the variety of conditions of the cats coming into the Sanctuary, the Former Owner understands that the cat (cats) surrendered may not be present should they wish to visit or find out more about the cat. Cats run away, become sick or injured or may be subject to other unforeseen circumstances. The Sanctuary cannot make any promises or guarantees for the cat (cats) continued health, survival or presence in the future. The Former Owner hereby fully surrenders ownership and agrees not to make demands for information about the cat or its condition. Further, the Former Owner agrees to hold the Sanctuary harmless and will never take legal or any other action against the Sanctuary or its staff, board, or other persons affiliated with it. As the Former Owner or authorized Representative, I hereby certify that I am the legal Owner and hereby renounce ownership. I understand the conditions above and fully agree to surrender the cat (s) described here to the Cat Beach Sanctuary for its lifetime. Cats Former Owner / Rescuer: Signed____________________________________ _____________________ _Print____________________________________ Acknowledged by Representative for Cat Beach Sanctuary: Signed____________________________________ ___________________________ _Print____________________________________ Date_____________________ 201 _ Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html Invest - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Invest Invest in the Future for Cats www.catbeachpenang.com www.paypal.me/TeviotCatBeachPenang Help Cat Beach achieve excellence in Cat Care, Education, and Tourism Cat Beach Sanctuary Over the past 3 years, Cat Beach Sanctuary has become a place of refuge where rescued cats receive loving care from volunteers, an educational centre where students and families come to learn about cats and a tourist / visitor attraction offering a unique and memorable experience interacting with friendly, adoptable cats at the beach. Please will you join me in investing in Cat Beach cats? Help us build the future for the cats? Could you invest in a gift once a month to help cats? For the past 3 years, I have given my all to seeing that cats and kittens rescued from desperate situations have some place to go. And in that time, Cat Beach has become something more than a shelter  it is truly a very special place where people come from all over the world to share the love with cats. People want to come to Cat Beach Penang; this gives real hope for the future. Like the Cat Islands in Japan and the Cat Cafes opening around the world, Cat Beach has a chance to become a tourist attraction. Teluk Bahang is up-and-coming with animal-oriented sites including Monkey Beach and Turtle Beach, the Entopia (Butterfly Farm), and Escape. Animal shelters in Phuket and Koh Lanta, Thailand receive the highest ratings on TripAdvisor. We hope someday that Cat Beach will rate high and that visitors contributions will help to meet the growing costs of cat care. Cat Beach is also fast becoming an educational centre. Students from high schools and colleges have asked to come to volunteer, intern or just spend a lovely time with cats. In recent months, we have had groups including the Leo Club (junior Lions), AISEC international volunteers, and USM as part of their Convocation events. Pre-vet students and people exploring animal care as a career have found us and we hope to build a professional quality internship and volunteer program in the future. What started as a small project for about 100 cats has grown beyond my personal resources to handle. You are needed. Together we need to bulid a community of support  Cat Lovers International Society, Penang. As Cat Beach becomes known, kind rescuers keep bringing in more cats. Scarcely a day goes by without another cat or a litter of kittens arriving  each with a tragic story that melts our hearts. We are now caring for nearly 300 cats with only a small hardworking staff of volunteers. Cat Beach needs your help today to meet the rising costs of cat care. Why contribute? I think of the funds, time, and love I have given to Cat Beach as an investment for the long-term. With your investment, Cat Beach can achieve its goals: To give excellent care to rescued cats and provide a sanctuaryfur-ever To provide education about animal care and the environment To become a visitor attraction that gives a special experience while it supports cats welfare. Thank you for caring and sharing. All the best with furry hugs, Teviot & the Cat Beach Cats Teviot Fairservis, founder email: catbeachsanctuary@gmail.com whatsapp/sms: +6 017 575 3419 Together we can build a wonderful future for Cat Beach Penangs cats! Find Out More Copyright  2017 Cat Beach Sanctuary / Cat Lovers International Society, Penang, All rights reserved. Thanks for caring about rescued cats! Our mailing address is: Cat Beach Sanctuary / Cat Lovers International Society, Penang 778 Jalan Teluk Awak , MK 2 Teluk Bahang Penang , Pulau Pinang 11050 Malaysia Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html SHOP - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact SHOP SHOP 2nd Chances Charity Store AT CAT BEACH  YOUR PURCHASES GO TO SUPPORT RESCUED CATS! TRAVELERS BOOKSHOP & 2ND CHANCES CHARITY STORE OPEN WEEKENDS 11 AM TO 4 PM (OR BY APPOINTMENT) AT CAT BEACH & ONLINE SEE ALSO OUR PARTNERS ONLINE SHOPS: MiYa Co  House of All Things Cat www.miyaco.com.my GOLD-D PREMIUM CAT FOOD: Cat Beach Shelter, Penang TRAVELERS BOOKSHOP at Cat Beachs 2ND CHANCES CHARITY STORE Which book should I choose? What should I read next? The new TRAVELERS BOOKSHOP AT CAT BEACH has so many choices! Stop by for a brow se and a cuppa from the Cat Cafe! Biographies  History  Sports Arts  Science  Languages Kids Stuff and of course, TRAVEL! Shipping may be available on request. Write to catbeachsanctuary@gmail.com . Cat Beach is an Amazon.com Associate. Buy a book or any other item from Amazon. By clicking on the icon, Amazon will ship to you and a percentage will go to support the Cat Beach cats! 2ND CHANCES CHARITY STORE Other Products for Sale to help Cats Featuring pre-loved and new items donated by caring cat lovers to help support the Cat Beach Cats. Visit any weekend or attend our bi-monthly Yard Jumble Sales! Follow us on Facebook at CatBeachPenang for all the upcoming events and information. In the Charity Store  Childrens Toys, Household Items, Furnishings, Jewelry, and lots of Clothes, Shoes, and so much more! SHOP OUR WONDERFUL SOCIAL ENTERPRISE PARTNERS: MIYACO Cat Items & GOLD-D Cat Food MI  for Miow Meow YA  the Japanese word for shop CO  for company HOUSE OF ALL THINGS CAT www.miyaco.com.my Click here to have Gold-D premium cat food sent directly to Cat Beach. It has done wonders for our sick cats! We are so grateful for gifts of Gold-D food. http://gold-d.com.my/donation/cat-beach-shelter-penang/ TO REQUEST OR DONATE ITEMS, PLEASE CONTACT US AT catbeachsanctuary@gmail.com or Whatsapp/sms to +6 017 575 3419 . Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html ABOUT - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact ABOUT About Us Love cats? Please join the nonprofit Cat Lovers International Society! Dedicated to improving the welfare of cats in communities across the globe, we believe in think globally, act locally. Visit Cat Beach Sanctuary in the fishing village of Teluk Bahang on the island of Penang, Malaysia where more than 200 cats rescued from desperate situations find loving care. Future projects planned include publications and educational programs, internships for veterinary students and trainings for those who wish to learn more about cat care, and arts projects celebrating all things cat. Also in the works are a Cat Cafe and charity store projects to help support the Cat Beach cats. Please like our Facebook Page to learn more about how you can connect with other cat lovers, learn more about cat care  or just enjoy sharing the antics of our furry friends! @CatBeachPenang And yes, were a little bit different from other cat caring orgs  we also want to create a worldwide network of support for the PEOPLE who love cats. Many hometown heroes are out there feeding colonies of ferals, many volunteers give long hours to shelters, clinics, and cat caring organizations. Cat owners find strays and take them home to foster; some even parent 20 or more cats  and find they are running a cat sanctuary! And thats whats happened in Penang, Malaysia where we are hoping you will help us support our first major project: the Cat Beach Sanctuary. When Barbara Janssen, founder of the Penang Animal Welfare Society and 4PAWS dog shelter introduced her American cat-loving friend, Teviot Fairservis, to Mr Nana Bin Wanchik, a fisherman who has been feeding cats for a decade, a new idea was born  Cat Beach. Cats rescued from desperate situations need some place to go  so together they began to transform an old wooden house on the beach into a sanctuary for cats in need. With the help of many volunteers since July 2014, Cat Beach has become a truly special place for both cats and people. Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html Help the Cats! - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Help the Cats! How can I help? There are so many ways! ADOPT DONATE VOLUNTEER SHOP ADOPT  A house is not a home without a cat! Help a cat and help yourself! Bring a cat (or 2 or more!) into your life for hours of fun! Cats are the cleanest and probably the easiest pets to have in your home!Cat Beach staff have lots of information to share about caring for cats and kittens. Thinking about getting a cat? Please read our preparation checklist, a free downloadable e-booklet on our Adoption page  YOUR NEW CAT.Remember, please  adoption is a serious commitment with many cats living 10 years or more.Please plan how you will be able to care for the cat every day. FOSTER Cant keep a cat permanently? Our foster parents provide a valuable service by caring for cats until a forever home can be found. Some even take on the sick or injured cat or kittenthat needs special care. DONATE Your gifts of fundsor items help so much to give these cats the care they need! Food is the most expensive and important cost  and in-kind gifts of cat food are very welcome. You can even order cat and kitten food to be delivered to the Sanctuary through Tesco at www.tesco.com.my or lazada.com.my and other online stores. Cleaning supplies like bleach and toilet roll, cat medications and grooming tools, toys, and cat-themed items, as well as food and items for the long-stay volunteers all very much appreciated. You can also designate your funds to be used specifically for vaccination, sterilization, veterinary care, renovations to the property, or any special project. VOLUNTEER As an all-volunteer Sanctuary, we depend on volunteers to keep the place running smoothly. With lots of daily housekeeping and cat care to do, if you can clean or help medicate cats, you can come help almost any time  day or night. You can even come stay at the beach and live with the cats! Volunteers also take leadership or assist on producing events, outreach programs, renovations and other projects to upgrade and improve the lives of the Cat Beach Cats. Read more about volunteering here /volunteer/ Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html ADOPT - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact ADOPT Are you ready to have a new family member? Your new cat will love you for a lifetime! See our Your New Cat checklist for all you need to get started. Cat Beach Sanctuary does not believe  as policy  in the sale of animals. Adopt, dont shop! Come to the Sanctuary and let a cat choose you. There are so many friendly cats just waiting to meet their person! You can make all the difference in their life  with a good, loving home! ADOPTION REQUIREMENTS To adopt a Cat Beach cat, the Sanctuary requires: A Signed Form  a simple agreement promising that you will give good care of your cat. Carry Case or Cage  to take a cat home (no cat should ever roam free in a car. Vet Appointment  for health assessment and vaccination. Optional but suggested for transport: cat collar and leash. CONDITIONS All pet owners need to understand that cats coming from a multi-cat environment may carry diseases, even if they have no symptoms. Cat Beach cats are rescued from truly desperate situations and may have illnesses or injuries that may require veterinary care in the future. Please understand that while our all-volunteer staff is doing the very best we can to provide a good life for the cats, cats are known for disguising illness and injuries. While we do not normally allow a cat with known issues to be adopted. we cannot guarantee that an adoptable cat will be in perfect health. That is why it is important that at the time of adoption, a professional licensed veterinarian should assess the cat for health issues and give a vaccination (if not already done). What should I expect? Costs: Cat Care expenses at the Sanctuary average about RM 2 to 3 per day for each cat (times 365 days in the year = RM 730). This includes food and estimated costs for cleaning supplies. This is a rough estimate of your future cat care costs for a year  plus you should budget for some additional costs for Vet Visits  about RM 40 to 50 for vaccination, RM 150 to 300 for sterilization. And of course, put aside a bit for the fun things as you will want to get your cat toys and other treats! Damages: Plan also for the not-so-fun like minor damage to furniture (yes, cats have claws and some like to knock things on to the floor, some even like to remove the keys from the computer keyboard). Be prepared for the possibility of messes, especially in the early days when the cat is learning its new environment. Behaviors: Never punish a cat for making a mistake  they just become stressed and upset which can lead to illness. Instead, teach it what you expect  cats are smart and learn fast! For example, for scratching issues, give it a scratching post or cardboard and demonstrate how to use it. Putthe cat into a litter pan if it pees or poops in the wrong place  most cats will learn quickly. Clean the litter pans often, at least once a day. Watch the cat carefully if it does make a mistake outside its litter pan; there is the possibility that it may have a urinary or intestinal problem that needs veterinary attention. Away Times: Please give some thought to boarding costs or having a responsible person care for your cat when you need to be away from home. Think too about how lonely a cat can become if no one is home all day. We do recommend that two cats are better than one even if they are not best friends at the start. Normally cats like to socialize with their own kind, unless they get lots of attention from their person. Other things you should consider: Where will my cat live in my home? Designate 4 separate areas: 1) sleeping 2) eating 3) playing and 4) toilet. Keep toilets as far away as possible from food. Listen to and watch your cat  you and your cat may need to negotiate if the cat doesnt like your choices (yes, cats are intelligent!). Will my cat be able to go outdoors? If so, how will you be sure it is safe and can return to your home at night? What are the potential safety hazards in your home and neighborhood? (Examples: motorbikes, cars, dogs, other cats, predator animals, neighbors that put poisonous things on their lawns and gardens, etc.) How will my cat relate to humans? Some cats are shy, others bold. As you get to know the temperament and preferences of your cat, you can also teach and learn from them. If you have any behavioral problems, please contact Cat Beach or go online to the many cat advice sites. Heres a checklist of items you will want to make you and your cat feel comfortable in its new home: Your New Cat Checklist Please feel free to download the Your New Cat pdf which is shared from Google Drive and updated from time-to-time. If you have difficulties with access, please contact us at catlovers.my@gmail.com and we will email the handout to you directly. We can also recommend the publications by the animal food manufacturer, Royal Canin, especially their Kitten Guide athttp://www.royalcanin.com.au/kitten-cat/kittens/kitten-guide. Many other resources are available on the internet. We often refer to www.petmd.com and other sites. Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html DONATE - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact DONATE Why do we need Cat Beach? Why a No Kill Sanctuary for cats and kittens rescued from desperate situations  the cats last resort? Because these little guys deserve a chance to live. YOUR DONATIONS MAKE A WORLD OF DIFFERENCE TO CATS IN NEED Your generous gifts of funds, cat food, and other items give rescued cats a second chance. With your help, we can sustain and continually improve this no kill, all-volunteer sanctuary, now caring for some 250 cats. To see the Cat Beach Sanctuary operating budget, please click here: 2017 Operating Budget To donate funds: Allincome received from donations and sales goes to support the care of the Cat Beach Cats. Online Donations PayPal Me  TeviotCatBeachPenang You do not need to join Paypal to send funds from debit or credit card through the PAYPAL ME program. 100% of donations to Cat Beach Penang sent via PayPal are passed through founder Teviots savings account in the USA, then accessed via ATM. Please contact Teviot at teviothome@gmail.com if you wish to transfer to a USA Bank Account. GoFundMe Cat Lovers www.gofundme.com/catloversintl GoFundMe is the largest US based international crowdfunding site. Direct Deposits can also be made in Malaysia to: CIMB Bank Malaysia Savings Account # 7063481337 in the name of Mohd Iqbal bin Zainal (*As the president of the Cat Lovers International Society, Penang, he has kindly opened this account to allow support of the cats while formal applications with government and banks are completed.) Please notify us by email, messaging, or whatsapp of your donation so we can thank you! catbeachsanctuary@gmail.com + 6 017 575 3419 SMS, Whatsapp To donate In-Kind Items (like cat food, cleaning supplies, and more): Order online or at the store from Tesco Penang www.tesco.com.my or Lazada.com or other delivery services  Have them deliver your gift to Cat Beach! Address: Cat Beach Sanctuary, 778 Jalan Teluk Awak, MK 2, Teluk Bahang, 11050, Pulau Pinang, Malaysia SUPPLIES USED EVERY DAY Cat Food Whiskas Junior (or ProDiet) pouches [24 in a box  we use at least 2 boxes per day] Adult Cat Food Cans (any brand)   [cats eat 8 to 12 cans per day, mixed with rice and kibble] Kitten Kibble dry food (any brand)   [3 to 5 kg per day] Adult Kibble dry food (Tesco brand is ok!)  [10 kg per day] Rice [3 to 5 kg per day] Fresh fish or chicken (to be boiled) Cleaning Supplies Newspaper Clorox Cleanup Bleach Toilet paper / kitchen roll Garbage bags (medium sized, heavy duty) Sponges, mops, buckets, brooms, etc. Grooming Supplies Baby wipes (antibacterial and regular) Facial cotton pads Saline Solution Flea Treatments Also see our dream WISH LIST Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html 2017 Operating Budget - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact 2017 Operating Budget Cat Beach Sanctuary      Annual Operating Budget  2017 * Operating expenses as listed here are basic expenses Daily Cat Food for 150+ cats 6  8 cans/day of commercial wet food 10 kg of commercial dry food (available 24/7) Vitamins and other supplements Junior food pouches for kittens, moms, sick cats, etc. Supplementary rice, fresh boiled fish or chicken Estimate RM 200 per day or RM 1 per cat per day x 100 cats 365 days x 200 = RM 73,000 / year Cat Meds Vet Visits including vaccinations, sterilizations, medications, emergency care Estimate: Average RM 1000 per month 12 months x 1000 = RM 12,000 / year Cat Care Cleaning supplies Grooming supplies Estimate: RM 500 per month 12 months x 500 = RM 6000 / year Other: Rent, Utilities Volunteer/Staff Expenses Program Expenses Miscellaneous & Emergency Funds Total Annual Operating Budget in Malaysian ringgit (RM / MYR)                                                                                       ___________ RM 110,000/ year (+/- $25,000 USD) Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html The Wish List - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact The Wish List THE WISH LIST With new cats arriving at Cat Beach Sanctuary almost every day, we struggle to keep up with the supplies needs and often talk about the many things needed and wished for. Below you can find our dreams and daily needs. If you or someone you know has supplies to share, preferably free or discounted, please do let us know!With your donation in-kind or in funds, you can really make a difference in the lives of the cats  and the people who love them! For ways to donate funds, please see https://catbeachpenang.com/donate/ . For items needed and dreamed about, please read on! THINGS WE DREAM ABOUT: Car or truck to transport cats to/from vet, do shopping, pickup newspapers & donated items Clear plastic roofing (or other clear material) to cover main areas and protect from rain Garden plants including catmint, cat root, catnip, lavender, etc that are safe for cats Large enclosures for separating groups of cats SUPPLIES WE USE EVERY DAY: Can you help? You can order most things online for direct delivery to Cat Beach from Tesco.com.my or through Amazon, Lazada, and other delivery websites {google search to find them). CAT FOOD Adult Cat Dry Food (Kibble, Chow) Kitten Dry Food Adult Commercial Canned Food (Whiskas, Friskies, etc.) Junior Kitten Food (Whiskas or other Junior pouches) Vitamins, pro-Biotics, (Hexbio, Maxbio), other supplements for immune support Kitten Milk Replacer, kitten and mother cat supplements Fresh chicken (for kittens, cats with diarrhea) Fresh caught fish Pumpkin Cat Treats CAT MEDS Amoxicillin or Clavamox oral antibiotics Doxycycline oral antibiotics Chlorpheniramine, Zyrtec, Adezio or other antihistamines for cats Bromhexine  antiphlegm Cough medicines safe for cats (Bronsyp, etc) Eye ointments and drops  e.g. gentamicin, terramycin,vigamox etc Ear cleaners and earmite meds Antiseptic ointments or creams Antifungal ointments or creams Antifungal orals  Sporanox, itraconazole, ketaconazole, etc Bandages for wound care Supplements including Cat Vitamins, L-Lysine, Fish Oil, Vetri DMG, Taurine, etc. CAT CLEANING Baby wipes Cotton facial wipes Flea spray Flea combs Grooming brushes & combs Dewormer Apple Cider Vinegar Saline Solution Coconut Oil CAT BEACH CLEANING Garbage bags (small, medium, heavy duty large) Newspapers Clorox Cleanup (detergent + bleach) Bleach Antibacterial Laundry Soap Antibacterial Dishwashing Soap Microfibre cleaning cloths Cotton cleaning cloths Sponges Mops, brooms, other cleaning tools Bathroom cleanser Salt, Turmeric, other natural products to reduce flies, fleas, pests, germs Serai Wangi Lemongrass spray Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html Cat People - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Cat People Cat People come to Cat Beach from all over the world! Volunteers seen here from Brazil, Myanmar, United Kingdom, United States, Ukraine  and Penang, Malaysia! Mr Nana and Ms Teviot  co-founders of Cat Beach Sanctuary and the Cat Lovers International Society See this article about founder Teviot Fairservis in Connecticut Magazine , March 2016 12.27.2016 http://www.thestar.com.my/metro/community/2016/12/27/purrfect-time-to-help-furry-friends-in-kitty-wonderland/ The Star Meowy Christmas 10.04.2016 http://www.freemalaysiatoday.com/category/nation/2016/10/04/feline-lonely-just-head-to-penangs-cat-beach/ Free Malaysia Today Feline Lonely? 6.16.2016 https://drive.google.com/drive/u/0/folders/0B4Fqd9dgMq_rWFdMZklRZ3VVZkU Expat Magazine Interview with Sinatra Cat by Frances Wilks 12.10.2016 https://drive.google.com/drive/u/0/folders/0B4Fqd9dgMq_rb2wtSlRsSnBNdlk Malay Mail Purr-fect Haven 04.2016 https://drive.google.com/drive/u/0/folders/0B4Fqd9dgMq_rWFdMZklRZ3VVZkU Connecticut Magazine A Connecticut Cat Lady Making a Difference in Malaysia 07.01.2017 http://www.thesundaily.my/news/2017/06/27/cat-beach-needs-funds-maintain-feline-inhabitants The SunDaily 08.16.2017 http://www.kwongwah.com.my/?p=374155 Kwong-wah (Chinese News You Complain, I Die press conference Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html Page not found - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Oops! That page cant be found. It looks like nothing was found at this location. Maybe try one of the links below or a search? Search for: Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Most Used Categories News (31) Uncategorized (27) *Highlight (12) Archives Try looking in the monthly archives.  Archives Select Month October 2018 September 2018 July 2018 May 2018 March 2018 February 2018 January 2018 November 2017 October 2017 August 2017 May 2017 March 2017 February 2017 December 2016 November 2016 October 2016 September 2016 July 2016 June 2016 February 2016 November 2015 September 2015 May 2015 Tags Advocate art at cat beach benefit cat Cat Beach Cat Beach Sanctuary Cat Cafe cat care Cat Lovers International Society cat nurse Cats cat sanctuary cats penang charity sale Christmas donate education event Harian Metro helpcats internship jobs Jumble Sale kittens kittensintrouble Malaysia minizoo nurse Paradise for Cats Penang Penang island Penangpac rabies Sanctuary stamps Teluk Bahang theatre TICKETS tourism vet care veterinary vet tech volunteer Welcome to Cat Beach worldwide veterinary services Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html GALLERY - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact GALLERY CAT BEACH CATS ARE SO PHOTOGENIC! DearCat Friend, Cant get enough of Cat Pics? Here you will find pictures and videos of our lovely cats, volunteers, guestsand beautiful Cat Beach Penang! We welcome photographers and videographers, and regular people with smartphones and tablets  come on out to Cat Beach and meet the cats! Please do share your work with us and on social media. You can help the cats by sharing and caring! The Cat-a-log : a gallery of our cats. Adopt a Cat! Daily life of our cats (and people) Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html Products - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Products PRODUCTS FOR SALE TO HELP CATS No, we dont sell cats. Theyre FREE to good homes. We just require that you pay a vet of your choice for a health assessment and vaccination, and schedule a future sterilization. See our Adoption page for full information and your free downloadable e-booklet, YOUR NEW CAT. https://catbeachpenang.com/adopt/ 2ND CHANCES CHARITY STORE Current Inventory : 10 Printers  HP, Canon, etc.  some issues, missing cables or low on ink. Clothing  assorted tops, bottoms, skirts, dresses, Malay style baju, mens and womens Shoes  men, women, childrens sizes Toys  soft stuffed animals, large and small Assorted Household Items, Jewelry, etc. TRAVELERS BOOKSHOP Wide variety of Fiction, Biographies, History, Languages, Travel Books  looking for something in particular? We will check our inventory. Email us at catbeachsanctuary@gmail.com Amazon.com Associate link  Buy the book you want online by clicking here and have Amazon ship to your home. A percentage of your purchase will help to support the Cat Beach cats! SEACATS ART GALLERY Artists like cats! And create wonderful Cat Art, beach scenes, and so much more  both abstract and realistic. Support artists and cats! Purchase art on display now at Cat Beach. CAT BEACH ACADEMY Currently online classes to learn English. Reading, Writing, Speaking, Listening. Professional teachers with years of experience, donating a portion of their class fees to help cats. Sign up by writing teachertevi@gmail.com. WERE BUILDING ASSOCIATE AND AFFILIATE LINKS TO HELP SUPPORT CATS Amazon.com  catbeach-20 Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html RESCUE - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact RESCUE Kittens are not trash. LETS SAVE THE CATS! Thank you for your care for cats. These beautiful creatures depend on human care and yet too often are found in desperate situations. With your help, Cat Beach can give those in greatest need a sanctuary where they can receive loving care. FOR CATS IN NEED OF SANCTUARY If you have a cat or kittens in a truly desperate or emergency situation and wish for help or for it to go to Cat Beach, please contact us first to discuss  we may have suggestions and information (call /msg /whatsapp /FB msg  6 017 575 3419). Please do not show up without warning or dump cats at Cat Beach without receiving permission. To transport a cat or kitten, please place it inside a box or carrier; never let a cat roam free in a car as there is a real potential that it may escape or cause an accident. Once you have received permission to bring the cat, volunteers at Cat Beach will need to prepare a cage lined with newspaper, prep clean bowls for food and water, and ensure someone is there to receive the cat and complete the paperwork. Unless it is an emergency or the rescuer is truly destitute, we ask that all cats older than 6 weeks be brought first to a veterinarian for health check and vaccination. It will be good if kittens can go to a vet but it may be more important to rush them to the Sanctuary for feeding and care  kittens may not survive if not fed every few hours. You will also be asked to sign the Surrender Form (link here). Please do share as much information about the cat as you can. SEE BELOW: STEPS FOR A GOOD RESCUE  Kittens, Juniors, Adult Cats Please understand that Cat Beach is an all-volunteer sanctuary and there is no resident vet. Our volunteers promise to do the best we can to give basic care including regular food and to carefully follow the instructions of veterinarians if the cat needs nursing care. Please consider what is best for the cat: a good home. Your help to find it a home is a crucial part of good rescue. Please try to be supportive of the new owner or shelter. Almost every day, cats and kittens are found by kindhearted rescuers. They may be sick, injured, abandoned or given up for many reasons by their caregivers, lost or rejected by their mothers, or part of a colony of Community Cats that humans no longer want around. There are many reasons why cats become homeless and helpless. Unlike wild animals, domestic cats rely on their relationships with humans for their survival  they need and deserve our help. It is important that people understand that Cat Beach Sanctuary is and should be only the last resort. Please try to make every effort to find another alternative before sending a cat to Cat Beach or any shelter. Finding a loving home offering proper care is a far better alternative than sending a cat (or any animal) to a shelter. Please do whatever you can to help the cat find a fur-ever home. STEPS TO A GOOD RESCUE: Take pictures . These can be the most valuable tools to identify the cat. You may need assistance to capture the cat and that can help others identify it. The photos help track the cat for the sanctuary. They also can be posted in hopes of adoption and fostering. And good photos also can be used for promotion to help create interest in the public in supporting cat care. Capture the Cat. A simple cardboard box or a cage or carrier can help to transport a cat safely. If the cat is difficult to catch, you can put food inside the carrier and wait for it to go in. It may take several days so be patient! Plan Transport. If you need help capturing or transporting, contact us for a list of rescuers, pet transporters, and organizations that may be able to assist you. Many of the new Grab Car drivers will allow cats in carriers. Some will even deliver. Please do not let the cat roam free in the car  it can cause an accident if it bothers the driver or it may jump out a window or the door when you arrive. Please carry cats by car; not by bike or motorcycle unless it is an emergency. Take the Cat to a Vet for Health Assessment, Deflea and Deworm. Ask the vet to clean the cat so it does not carry diseases (especially important with kittens which may be carriers), give it a deworming if 2 weeks or older, and give a safe age-appropriate flea treatment. Please bring or send the vets instructions and information to the Sanctuary so it can be copied for the files and correctly cared for. Get the Cat Vaccinated and plan Sterilization. A vet can assess the cats health and start any needed treatment right away. Vets can also do tests to determine if the cat has a disease that might be contagious to other cats. If it is old enough, get the cat vaccinated for its own protection and to protect other cats. Please plan to help get the cat sterilized. Typically an adult should rest 10 days after vaccination before the operation. Some vets will do the operation and vaccinate the same day. Send pictures and contact information out widely. Post on Facebook, Twitter, Instagram, send to your Whatsapp and Message contacts, share with your family and friends. Be sure to write up a basic description, the situation, and include how to contact to adopt the cat. Post to pages, groups, etc.  www.petfinders.com.my, Lovely Cats for Free Adoption, many others. Make printouts, flyers, banners, cards. Distribute them wherever you go. Hand flyers with pictures of the cat and tells its story to everyone you meet. Give them out at the grocery store and tell the cashier. Tell the waiter at the restaurant and hand him or her a picture. Ask the managers if it is ok to tape up a poster on the wall. Dont forget to put them up at veterinarians and pet shops. Tell everyone you meet that you know or have a cat or kitten ready for adoption. Consider supporting the cat you saved and all his/her furry friends at Cat Beach! IF YOU DECIDE TO RESCUE A CAT OR KITTEN, WHAT SHOULD YOU DO? FOR KITTENS  under 6 weeks The best chance a kitten has for survival is to be placed with a nursing momcat who will do all the work of its care. If anyone you know has a nursing mom, try to get the kitten to her as quickly as possible. If the kitten is less than 6 to 8 weeks old and is found in Penang state, then please do immediately contact Cat Beach . We will try to find a momcat to nurse it or possibly connect you to other shelters or foster carer. If it is old enough (3 to 4 weeks) to eat solid food, please give it JUNIOR FOOD which comes in pouches. They can usually survive on the soft food which is enriched with proper nutrients. Please consider caring for it in your home until an adopter can be found. While during Kitten Seasons, the Cat Beach Nursery can be overwhelmed, we will accept kittens under 6 weeks as their last best hope for survival. Heres first steps: Box the Kitten When you find a kitten, put it into a box  a very clean cardboard or plastic box lined with newspapers will work and will keep in heat. Put in a soft piece of cloth for a bed. You can cover but be sure there is plenty of air to breathe. Warm the Kitten Kittens cannot regulate their body temperatures so keeping them warm (but not hot) and cosy is important. If it is a cool day or the kitten seems cold, take a plastic soft drink or water bottle and fill with hot water. Wrap in a towel and put at one end of the box. Be sure the kitten can get away from it if too hot. Feed the Kitten Drinking is crucial or kittens can quickly dehydrate. You can get a syringe at a pharmacy or just use your (very clean) finger to drip small drops of liquid into its mouth. Other ways include dipping a sock or cloth and letting the kitten suck on that. You can even use a spoon. Feed the kitten warm WATER even if you do not have kitten milk. Cow milk is not recommended as can cause diarrhea although in an emergency, thin the cow milk with warm water. Goat milk is very good for kittens. Evaporated (not sweet condensed) milk is good, too, as a temporary solution. There are recipes for Kitten Glop mixing evap milk, egg yolks, mayonnaise, yogurt, and gelatin. Even some of those ingredients short-term may give the calories a kitten needs. Get equipped. Go to a pet store and purchase Kitten Milk Replacer and a kitten bottle if you will be feeding for several days. See the free downloadable e-book from KittenLady.org for instructions on kitten care: Orphaned Kitten Care and watch her videos for good suggestions (www.kittenlady.org)After getting a momcat to care for the kitten, the next best choice for a kittens survival is for a human (You?) to take on the handfeeding fostering. Neonates under 3 weeks will need feeding every 2 to 3 hours, all night too. Lots of good advice on kitten rearing on websites  www.kittenlady.org and others. Cat Beach can also give advice if you decide to foster the kitten. FOR JUNIORS AND ADULT CATS Except in dire emergencies, please request permission for any junior and adult cats to come to the Sanctuary from the Cat Beach managers. Cats should be vaccinated before coming to the Sanctuary. There are several veterinarians along the route out to Teluk Bahang. Please just ask Cat Beach if you need the location of a vet near you or on the way. COMING TO CAT BEACH Upon arrival, cats are placed in a cage for a minimum of 1 week and maximum of 2 weeks for observation of their health and behavior. This time in a cage allows them to get used to the other cats, the people, and the environment. After that period, the cats are released into the compound to roam free. Usually they will stay around and become part of the colony. They learn to trust that there will be food and water 24/7 and a big family of cats and people to socialize with. SURRENDER Rescuers and pet owners who surrender cats to Cat Beach need to understand that the Sanctuary can make no guarantees for the cats continued health or safety. Because of the impossibility to fully enclose the property, the cats may run away (although not far as the town is surrounded by mountains on 3 sides and the sea on the 4th). They may hide (many possible places). With so many cats coming from desperate situations, it is possible the cat may catch a disease or become injured. It is very difficult to keep track of 250+ cats, so please understand that if you visit or request information about it, the cat you brought in may not be found. Our volunteers are kept very busy  so please be understanding if we are unable to respond to your request. WHY CAT BEACH? The property has a number of advantages because of its beachside location. There are many things that stress cats in shelters  at Cat Beach, the noise factor is minimized by the sounds of the waves; there is only 1 quiet dog so no barking to upset the cats; and there are lots of places to climb, play, sleep, hide. Apparent disadvantages such as the isolation of the community at the end of a long twisting road also work to the cats benefit. Based in an old wooden bungalow, the Sanctuary is not purr-fect but it has come a long way and every day, volunteers work hard to make it better. With the costs and effort required for cat care, here at Cat Beach, we would like to say No More! But as long as Cat Beach Sanctuary exists, it is our firm policy never to turn away a cat caught in a truly desperate situation. THE COSTS OF CARE With every new cat accepted, the budget must grow. In essence, rescuers and pet owners bringing a cat to the Sanctuary is asking our volunteers to raise RM 1000 for a year of care. Currently, we estimate that cat care at Cat Beach costs about RM 1000 per cat per year, about RM 80 to 85 a month. This means somehow we must find about RM 250,000 for a year of caring for 250 plus cats. Your help as a donor and by reaching out to others to help Cat Beach help cats can make a real difference. To help sustain Cat Beach Sanctuary as a special place for cats with nowhere else to go, please contribute whatever you can. Please see our page  https://catbeachpenang.com/donate/ To read our Surrender Agreement Form, click here . For more about Surrendering, click here. Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html VOLUNTEER - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact VOLUNTEER VOLUNTEER! For an hour, a day, a week, a month or more! Lots of opportunities! Come volunteer at Cat Beach and you will be rewarded with more kitty cuddles than you ever dreamed of! Come help us give the cats the best possible care. Every month, we must deflea, deworm, and check the cats including updating their records. Every day, we look for health issues and give special care to the new arrivals, the injured or sick. Kittens especially need daily care == cleaning, extra food and bottle feeding, meds, etc. And of course, all the cats need petting, stroking, hugging Many special projects need volunteer help including fundraising events like the Jumble Sales, Adoption Drives, and educational programs for the community. Renovation projects like repairs to the seawall and improving cages and enclosures are ongoing. Are you entrepreneural? You can help us manage dream projects to bring in income for yourself and the cats like the Cat Caf, 2nd Chances Charity Store, Travelers Bookshop, and Cat Art, and building eco-friendly gardens and facilities throughout the grounds. Come volunteer at Cat Beach! You can make a real difference for the cats! How to Apply? To volunteer, please email catlovers.my@gmail.com . Tell us little about your interests, some background, and dates you are available. Alternatively, you can sms or whatsapp to +6 017 575 3419. Short or Long-term? Volunteers are welcome even for 1 day  there is always so much to do to help the cats. If you can come weekly or monthly, you can receive training and become a trusted member of our all-volunteer Team of cat carers. We actively seek long-term volunteers willing to stay for a month or more. Some benefits may be provided such as accommodations at a nearby apartment or at Cat Beach and reimbursements for expenses like bus fare or petrol, phone, etc. Flexible Hours? Yes, 8 am to 10 pm, other hours by arrangement. Typical shifts are 4 hours  morning 8 to 12, afternoon 12 to 4, evening 4 to 8, and night shifts 6 to 10 pm. Volunteers may schedule their own hours; just discuss plans with supervisors. Internship or Externship Credit? credit may be possible by prior arrangement for those enrolled in credentialed programs. Founder Teviot Fairservis was formerly a university professor and nonprofit consultant and has supervised the work of many students over the years. If you want to see more of our volunteer pictures click here Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html Cat Lovers Int'l Society - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Cat Lovers Intl Society CAT LOVERS INTERNATIONAL SOCIETY/ Persatuan Pencinta Kucing Antarabangsa https://www.facebook.com/CatLovers.my Are you a Cat Lover? Would you like to be one? Then join the Cat Lovers International Society to celebrate cats! Thanks for helping cats! The Society is all about celebrating the joys of cats and improving the welfare of cats, by connecting with other cat lovers and cats  locally and globally. Dues are just RM50 (USD $12.25) as Lifetime Joining Fee, RM50 Annual Fee = Donation of RM 100 qualifies you as a Voting Member of the Society.* * If you have previously donated at least RM50, then you are automatically eligible for membership as a CAT LOVER! Donation information here: https://catbeachpenang.com/donate/ See our FB page @ https://www.facebook.com/CatLovers.my where we post things from all over the internet about our feline friends  lots are funny, many informative. Its the Cats Meow! CAT LOVERS PROJECTS Our current major project is serving as the Umbrella for the CAT BEACH SANCTUARY in the fishing village of Teluk Bahang on the island of Penang, Malaysia. To follow whats happening at Cat Beach, see our sister FB page @CatBeachPenang, explore the website  www.catbeachpenang.com And click here: Whatsapp Whats Up at Cat Beach orrequest an invitation to join our Whatsapp Chat  Whats Up at Cat Beach. Other projects include Educational Programs, Animal Experts Lecture Series, Webinars, Videos and Publications. We also hope to help facilitate Mass Sterilizations and Vaccinations of Community Cats. JOIN THE BOARD & ADVISORY COMMITTEES Please consider if you would be willing to meet online (or occasionally face-to-face) at least once a month to discuss and fulfill the requirements of the Malaysia Registry of Societies and to talk about what we all can do to help cats? A Bit of History As of January 21, 2015, the Registry of Societies approved the registration of the Cat Lovers International Society, Penang. The Mission and Objectives of the Society are as follows from the Constitution approved by the ROS: CONSTITUTION  CLAUSE 3  OBJECTIVES (1) To attract public attention to the proper care, needs and welfare of cats in Penang state. (2) To provide no kill sanctuary(s) and proper care for stray and homeless cats rescued in Penang. (3) To raise awareness in the public about adoption, rehoming, fostering, proper homecare and nutrition, veterinary care, vaccination, spay/neuter and the many other ways they can help improve the lives of cats and the community. (4) To share knowledge and experience among members of the Society, and to foster a spirit of cooperation among members. (5) To provide support for the cause of cat welfare and meet the Societys goals through various not-for-profit activities such as events, educational programs, promotions and outreach activities, and the like. Would you be interested in participating as a member of the Board Committee or Advisor? The Board Committee needs a minimum of 7 and maximum of 15 people committed to helping cats  with an unlimited number of Advisors  in order to meet the regulations of the Malaysia ROS. The Committee will meet online monthly  on or about the 1st of each month regularly and formally and informally thru Whatsapp chat, Facebook Messenger, and other technologies (Google Hangouts, Skype, gotomeeting webinars, etc!). If you join the Whatsapp chat for the Society, you can read and respond to the meetings at your convenience. For more information, write to catbeachsanctuary@gmail.com or whatsapp to +6 017 575 3419. Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html LINKS - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact LINKS Related links: For updates on whats happening at Cat Beach Penang, please see: http://www.facebook.com/catbeachpenang For all things cat from around the world (and yes, some from Cat Beach Penang, too): see and join Cat Lovers International, Penang and Kedah https://www.facebook.com/CatLovers.my Want to read more about Cat Beach Sanctuary? Thanks to the kind writers and Members of the Press for these articles: LIST OF PRESS COVERAGE FOR CAT BEACH SANCTUARY Related links http://www.facebook.com/catbeachpenang http://www.thestar.com.my/news/nation/2016/10/04/its-a-purrfect-life-at-cat-sanctuary-on-the-beach/ http://www.freemalaysiatoday.com/category/nation/2016/10/04/feline-lonely-just-head-to-penangs-cat-beach/ http://www.connecticutmag.com/Blog/Connecticut-Today/March-2016/A-Connecticut-Cat-Lady-Makes-a-Difference-in-Malaysia/ http://www.themalaymailonline.com/malaysia/article/cats-get-own-beach-in-penang http://travel.detik.com/read/2016/10/04/185455/3313372/1520/cat-beach-di-malaysia-destinasi-unik-untuk-traveler-pecinta-kucing http://www.thestar.com.my/news/nation/2016/10/04/its-a-purrfect-life-at-cat-sanctuary-on-the-beach/ http://www.freemalaysiatoday.com/category/nation/2016/10/04/feline-lonely-just-head-to-penangs-cat-beach/ http://www.connecticutmag.com/Blog/Connecticut-Today/March-2016/A-Connecticut-Cat-Lady-Makes-a-Difference-in-Malaysia/ http://www.themalaymailonline.com/malaysia/article/cats-get-own-beach-in-penang http://travel.detik.com/read/2016/10/04/185455/3313372/1520/cat-beach-di-malaysia-destinasi-unik-untuk-traveler-pecinta-kucing #inktober2016 Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html Volunteer Gallery - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Volunteer Gallery Our Volunteers! Here you will find pictures of some of our volunteers whove helped us so much over the years. We really do rely on volunteers like you who help us make Cat Beach a happy home for the cats and the people. The area is also a wonderful quiet town to get away from it all and enjoy our local tourist attractions. If you think you would like to get involved and join our team of volunteers, please click here to email us ! Tom Nik Sebastian Agnes Jurgen Leni Ben Sara Mikaela Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html Apply here - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Apply here Vet Nurse Location: Teluk Bahang, Penang Salary: RM1500  RM2200 a month (depending on experience) Email applications: catlovers.my@gmail.com We are seeking a nurse who genuinely loves and cares for animals to join our team at Cat Beach Sanctuary in Teluk Bahang, Penang. We are a no kill shelter and the last resort for many cats in the area. Many cats are rescued and brought to us sick or injured and as we have now grown to 200 cats, we need more help in caring for them. The key parts of your role are: Precisely carrying out medical instructions given by a licensed vet, giving nursing care to sick and injured cats Maintaining hygiene standards in the sanctuary Keeping accurate records of the cats, their histories and medications You will take responsibility for dispensing medications to each cat according to the Vets instructions. You will monitor the cats well being and keep a written log of medications given. You will need to have excellent administration skills, including typing, in this role. You will also be cleaning cages, spaces and cats to ensure they are comfortable and protect against illness. To achieve high standards across the sanctuary, you will work closely with the Sanctuary Supervisor to monitor hygiene and take action when it needs to be improved. This will include regular daily checks on all areas, directing volunteers and staff as well as training and supporting the volunteer cat carers. You will need to enjoy working with others and be able to interact with a wide range of people from different cultures. Key requirements: Fluent English Fluency in Hokkien/Malay/Mandarin an advantage Nursing skills Experience caring for animals or people Computer literate, typing skills Communication, training and leadership skills Positive, self-motivated attitude Genuine love and care for animals is essential Experience nursing is preferred, applicants from all nursing fields are invited to apply. Less experienced candidates are welcome as training can be provided but a clear commitment to learn and a positive attitude is needed. This role is for you if : you have a strong desire to help animals in need and a commitment to always improving the care we can give them. You want to learn and improve your own skills and develop your career in animal care. You want to meet a wide range of people from different cultures who are all cat lovers in a positive, determined work environment. This role is full time and we are able to offer accommodation.. We are looking for someone to start immediately. We look forward to hearing from you! Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html DIRECTIONS - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact DIRECTIONS DIRECTIONS TO CAT BEACH Find us on Google Maps! Cat Beach Sanctuary on Google Maps https://www.google.com.my/maps/place/Cat+Beach+Sanctuary/@5.459903,100.2096663,17z/data=!4m5!3m4!1s0x304ae8897325cf0b:0xd910ede6d4cfb912!8m2!3d5.459903!4d100.211855?hl=en Welcome to Cat Beach Sanctuary! Our friendly cats love visitors!For more information, please see our Facebook pages for videos, photos, and latest info/ FACEBOOK Please LIKE our Facebook pages! Cat Beach Penang  our local site with news of whats up at Cat Beach Cat Lovers International Society , Penang and Kedah (Persatuan Pencinta Kucing          Antarabangsa)- .general global, cat news & entertaining cat stuff! WEBSITES We have this website (under construction) at www.catbeachpenang.com and also a crowdfunding donors site at www.gofundme.com/catloversintl. DIRECTIONS TO CAT BEACH SANCTUARY, TELUK BAHANG, PENANG, MALAYSIA Google Maps:Google Map to Cat Beach Cat Beach is literally on the beach in the small fishing village of Teluk Bahang, located in the northwest corner of the island of Penang. Cat Beach is located about the midpoint of the Teluk Bahang beach, about 10 minutes walk from the National Park. Let us know how you plan to travel  bus, train, plane, motorcycle, by foot, etc. and we may be able to can give more details.. The exact address is: 778 Jalan Teluk Awak (also known as Jalan Teluk Bahang), MK2 Teluk Bahang, 11050 Pulau Pinang (Penang island), Malaysia BY AIR If you are arriving by air at Penang International, the 102 bus will take you to Teluk Bahang in a little more than an hour for RM 4. Alternatively, you can come by taxi for about RM 60. FERRY FROM BUTTERWORTH TO GEORGE TOWN Most long distance buses, minivans and the train come to Butterworth  you can also get a bus to George Town or to the Sungai Nibong bus terminal in the southeast of the island. In Butterworth which is on the Malaysia mainland, both the local bus and the train station are walking distance to the commuter ferry (1 rm 20 sen  very cheap). Its about 15 minutes ride across the channel to the island of Penang, arriving at the Jetty in George Town  a really gorgeous introduction to Penang. BUS From the Ferry Jetty, the bus station is right in front. Buses run from the Jetty starting on an east-west route along Lebuh Chulia to KOMTAR bus station (a landmark 10-sided building in the center of George Town).Minivans and buses may also take you to the southern bus station at Sungai Nibong and you may have to transfer to get to KOMTAR  the main bus terminal is under KOMTAR and a shopping mall in George Town. Take a local Rapid Penang bus  numbers 101 or 102 (RM 2.70 to RM 4) they will be marked as heading to Teluk Bahang Tk Bahang, or Telok Bahang). It will take 15 minutes to 1/2 an hour or so depending on traffic to cross George Town, heading west towards the first suburb  Tanjung Bungah. The whole trip from George Town to Teluk Bahang usually will take about an hour. TAXI Taxis from the airport or George Town will vary in cost  estimate RM 60 to RM 80. Penang also has Grab and Uber and you can download the apps to contact those services which are less expensive. THE TRIP WEST From George Town, follow signs for Tanjung Bungah to head northwest on the coastal road.You will pass through the neighborhoods of Tanjung Tokong and then Tanjung Bungah. Running parallel to the seacoast, the road becomes very twisty before your reach the tourist resort town of Batu Ferringhi after Tanjung Bungah. Lots of good restaurants and water sports there and a fun night market with souvenirs galore. About 10 minutes later, you will reach Teluk Bahang. ARRIVAL IN TELUK BAHANG By car , drive through Batu Ferringhi to the Roundabout in the Teluk Bahang (has a large sculpture of a pitcher plant called a Monkey Cup.) Turn RIGHT (go around to the left and then exit at 3 oclock to the right). By bus , you can get off at the first bus stop  the bus terminal  or ask the driver to let you off at the Roundabout. From the first bus stop, walk to the Roundabout (about 1 minute), passing Caltex petrol station, Alis Guesthouse (cheap dorm if you need more privacy than you get at Cat Beach), and Khaleel 24-hour Indian / Malay restaurant (yum!). From the Teluk Bahang Roundabout , turn RIGHT (3 oclock) and head towards the sea. The End of the World restaurant will be on your left. Go 2 blocks to the Police Station (if you are on foot, you can go straight and walk along the beach).  Turn LEFT and continue another 2 blocks to our driveway . You will pass Fishing Village Seafood  (top rated!) and then TB Seaside Cafe. The first driveway after TB Cafe on your right leads to Cat Beach. The Cat Beach driveway is located between a white concrete building and a red metal warehouse. Come in to the parking lot and say hello to the many cats! (Please be careful that they do not get hit by a vehicle). Park if you are in a car or motorcycle and continue to walk towards the beach. The brown wooden house right by the sea is the main house of the cat sanctuary. MORE BUS STOPS IN TELUK BAHANG If you miss the first bus stop, do not worry. Often but not always, the bus will turn left at the Roundabout and go to the Escape adventure park, then turns around and returns to the Roundabout. You can also get off at the very last bus stop on the bus line at Taman Negara , the Penang National Park . To walk back to Cat Beach, head east (towards George Town) along the road paralleling the beach. You will cross a bridge (cars cannot cross and must go back to the Roundabout). Pass a Hokkien Chinese shrine on the sea side, and continue until you come to a group of cafes around a parking area. On your left will be a red building with a cafe and a warehouse, followed by our driveway which is between the red warehouse and a white concrete building. Across from the driveway entry to Cat Beach is a parking area for the cafes (good food, drinks, local coffee!), a large corner dump (with cats roaming it), and an ice factory. For further directions or information, you can ask pretty much anyone in Teluk Bahang for Mr Nanas place or recently Cat Beach (we are just starting to get known in town). Or you can telephone (or borrow a mobile from a taxi driver or other bus rider if need be):  Malaysia Country Code = 6 Cat Beach Landline: 04 88 11 015. Cat Beach Mobiles: 017 575 3419 / 0112 644 7856 Note that services, batteries, chargers, etc. somehow seem to go down here more often than elsewhere so you may not get through  but come any way! NOTE TO OVERNITE VOLUNTEERS We ask that you please try to arrive at Cat Beach before sunset  it is difficult to work out accommodations and can be a bit spooky at night. If you are going to be late, please call to make arrangements. Best times to arrive: 10:30 am to 6 pm . Or stay at a homestay or hotel and come over in the morning. Many volunteers enjoy spending a few nights in George Town to rest after their travels and see some of the many attractions in the UNESCO Heritage section (you can take a free ride around the Heritage area on the CAT bus!). Please confirm your approximate arrival time by email and how long you think you will stay. And please do let us know if your plans change, especially if you are not able to come after confirming  we count on visitors and volunteers to help the cats! Thank you for your interest in visiting Cat Beach.Till then, enjoy! All the best, Teviot & Cat Beach Cats Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up html SURRENDER - Cat Beach Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact Skip to content Home EVENTS VISIT About Help the Cats! Cat Lovers Intl Society NEWS LINKS Why Cat Beach? Cat People 2018 Operating Budget 2017 Operating Budget RESCUE SURRENDER CATS INTAKE  Surrender Form Adopt Gallery The CAT-a-log Daily Life at the Beach Volunteer Gallery Volunteer Jobs Apply here Advice/Info about Volunteering at Cat Beach Volunteer Cat Care Positions Available Directions Donate The Wish List Invest SHOP Products Contact SURRENDER SURRENDERING A CAT Cats come to Cat Beach for many reasons but they are only accepted as a last resort. We ask that owners and rescuers to make a sincere effort to find a home for the cat before considering sending it to Cat Beach or any other shelter. It can be stressful for cats to adjust to new surroundings, other cats, and a lack of a special person as their carer. Far better for the cat to have a loving home with a dedicated caretaker. But if nowhere can be found or if it is truly an emergency, then with your help and that of other donors, volunteers, and supporters, then there is now Cat Beach  the Last Resort for Homeless Cats. I have rescued a cat (or hope to rescue). What do I do? Please contact us immediately by sms/whatsapp at +6 017 575 3419. Please send photos and information about where the cat(s) is located, the situation, your name and how to contact you. Please understand that we cannot provide sanctuary for all the cats in need. Please do your best to find it a home. If the cat you wish to give up or have rescued is accepted for intake by the supervisors and will come to Cat Beach, you should know that you have to give up the right to be its owner. As an open sanctuarywith an all-volunteer team of cat carers, our ability to confine or track any given cat is very limited. While we do attempt to send photos and communicate with rescuers, please understand that our team cannot be expected to update you and the cat may or may not be present if you come to visit. Please understand there can be no guarantees possible for the cats future health, safety or survival at Cat Beach. Your cat could escape from the property, catch a disease from another cat, get injured  or with luck, it may beadopted. What can be guaranteed for as long as Cat Beach Sanctuary exists, is that every cat will have access 24 hours a day to food, water, and shelter from weather. Wonderful volunteers give their all to ensure that the cats receive loving care. We do the very best we possibly can Your generous support is crucial to the long-term sustainability of Cat Beach. Please donate generously to help Cat Beach help rescued cats. DONATE Please click here for the SURRENDER FORM . Our Facebook Page Recent Posts OCT 2018  Kindness Counts SEPT 2018  Wish Cat Beach Happy Birthday! JULY 2018  Be the Miracle JUNE 2018  Operation Snip-Snip! APRIL 2018  Kittens in Trouble Search for: Copyright  2019 \n\t\t\t\tCat Beach  All rights reserved. Powered by Redbox Easyweb HOME VISIT ABOUT RESCUE ADOPT GALLERY VOLUNTEER DIRECTIONS DONATE SHOP CONTACT Scroll Up",
        "most_freq_words": [
            ["cat", 912],
            ["beach", 549],
            ["cats", 431],
            ["volunteer", 261],
            ["gallery", 177],
            ["care", 162],
            ["help", 154],
            ["budget", 143],
            ["surrender", 143],
            ["operating", 142],
            ["home", 131],
            ["donate", 120],
            ["visit", 118],
            ["contact", 114],
            ["adopt", 110],
            ["wish", 109],
            ["rescue", 108],
            ["directions", 107],
            ["shop", 107],
            ["people", 106],
            ["sanctuary", 100],
            ["please", 98],
            ["lovers", 95],
            ["society", 94],
            ["daily", 89],
            ["list", 78],
            ["penang", 77],
            ["available", 76],
            ["links", 75],
            ["life", 75],
            ["events", 73],
            ["form", 73],
            ["jobs", 73],
            ["apply", 73],
            ["intake", 72],
            ["catalog", 72],
            ["volunteering", 72],
            ["news", 71],
            ["invest", 71],
            ["products", 71],
            ["adviceinfo", 69],
            ["intl", 68],
            ["positions", 68],
            ["kittens", 66],
            ["get", 57],
            ["may", 57],
            ["food", 54],
            ["volunteers", 51],
            ["need", 48],
            ["facebook", 45],
            ["page", 44],
            ["teluk", 44],
            ["day", 42],
            ["come", 41],
            ["many", 41],
            ["go", 40],
            ["july", 40],
            ["us", 39],
            ["bahang", 39],
            ["kitten", 39],
            ["etc", 39],
            ["also", 38],
            ["happy", 36],
            ["june", 36],
            ["search", 36],
            ["posts", 35],
            ["operation", 35],
            ["new", 34],
            ["work", 34],
            ["recent", 34],
            ["copyright", 34],
            ["rights", 34],
            ["reserved", 34],
            ["html", 33],
            ["skip", 33],
            ["content", 33],
            ["oct", 33],
            ["kindness", 33],
            ["counts", 33],
            ["sept", 33],
            ["birthday", 33],
            ["miracle", 33],
            ["snipsnip", 33],
            ["april", 33],
            ["trouble", 33],
            ["powered", 33],
            ["redbox", 33],
            ["easyweb", 33],
            ["scroll", 33],
            ["rm", 32],
            ["support", 31],
            ["malaysia", 30],
            ["make", 29],
            ["bus", 29],
            ["give", 29],
            ["rescued", 28],
            ["take", 28],
            ["vet", 27],
            ["town", 26],
            ["see", 25]
        ]
    }, {
        "url": "http://www.destinystartingpoint.com/",
        "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\" Destiny Starting Point - Home Call us :  03  33724768 | 016 9288139 | 014 9695057 Home About Us Objective History Founder's Heart Activities Our Need Donate Gallery Contact Us DESTINY STARTING POINT (JUVENILE HOME FOR BOYS) God created everyone in His own image.The devil had distorted this image through sin which caused many teenagersto fall.Our vision is to restore these broken images and destine them to be a useful vessel to God, society and nation. OUR HOME By starting a HOME.Home is a neutral environment where these people will be able to express themselves.  A home also provides stability,love,secure and environment to change. MISSION STATEMENT Our task is to see these boys to be a whole person,useful vessels,skillful teenagers, winning youth for their home,nation and fortheir CREATOR GOD !God created each teenager with a Destiny.And this Home will enable them to reach their DESTINY. Activities We have a vision, we have a dream; to see these broken lives remolded into GODS IMAGE ! Skill Training Free Haircut Gardening Tuition Going To School What We Do Each individual would be given duration of 2 years or more,by which we hope some new solid,be formed. Training in basis skill Basic hygiene classes Counseling Character bilding Nature studies How You Can Help God created each teenager with a Destiny.And this Home will enable them to reach their DESTINY. Be a financial contributor Be a motivator Be a resource provider Be a listening ear Be a friend ! Copyright  Destiny Starting Point.com. All Rights Reserved Design By Dotcomnetwork.biz",
        "most_freq_words": [
            ["home", 7],
            ["destiny", 5],
            ["starting", 4],
            ["god", 4],
            ["us", 3],
            ["created", 3],
            ["point", 2],
            ["activities", 2],
            ["boys", 2],
            ["image", 2],
            ["vision", 2],
            ["broken", 2],
            ["environment", 2],
            ["see", 2],
            ["teenager", 2],
            ["destinyand", 2],
            ["enable", 2],
            ["reach", 2],
            ["skill", 2],
            ["training", 2],
            ["html", 1],
            ["public", 1],
            ["xhtml", 1],
            ["10", 1],
            ["transitionalen", 1],
            ["call", 1],
            ["objective", 1],
            ["history", 1],
            ["founders", 1],
            ["heart", 1],
            ["need", 1],
            ["donate", 1],
            ["gallery", 1],
            ["contact", 1],
            ["everyone", 1],
            ["imagethe", 1],
            ["devil", 1],
            ["distorted", 1],
            ["sin", 1],
            ["caused", 1],
            ["many", 1],
            ["teenagersto", 1],
            ["fallour", 1],
            ["restore", 1],
            ["images", 1],
            ["destine", 1],
            ["useful", 1],
            ["vessel", 1],
            ["society", 1],
            ["nation", 1],
            ["homehome", 1],
            ["neutral", 1],
            ["people", 1],
            ["able", 1],
            ["express", 1],
            ["also", 1],
            ["provides", 1],
            ["stabilitylovesecure", 1],
            ["change", 1],
            ["mission", 1],
            ["statement", 1],
            ["task", 1],
            ["whole", 1],
            ["personuseful", 1],
            ["vesselsskillful", 1],
            ["teenagers", 1],
            ["winning", 1],
            ["youth", 1],
            ["homenation", 1],
            ["fortheir", 1],
            ["creator", 1],
            ["dream", 1],
            ["lives", 1],
            ["remolded", 1],
            ["gods", 1],
            ["free", 1],
            ["haircut", 1],
            ["gardening", 1],
            ["tuition", 1],
            ["going", 1],
            ["school", 1],
            ["individual", 1],
            ["would", 1],
            ["given", 1],
            ["duration", 1],
            ["years", 1],
            ["moreby", 1],
            ["hope", 1],
            ["new", 1],
            ["solidbe", 1],
            ["formed", 1],
            ["basis", 1],
            ["basic", 1],
            ["hygiene", 1],
            ["classes", 1],
            ["counseling", 1],
            ["character", 1],
            ["bilding", 1],
            ["nature", 1],
            ["studies", 1]
        ]
    }]
}